{"metadata": [{"@context": "https://schema.org", "mainEntityOfPage": "https://www.moneycontrol.com/news/business/markets/hot-stocks-trading-strategies-for-itc-manappuram-finance-and-adani-ports-6659341.html", "@type": "NewsArticle", "url": "https://www.moneycontrol.com/news/business/markets/hot-stocks-trading-strategies-for-itc-manappuram-finance-and-adani-ports-6659341.html", "articleBody": "Since the start of this week, Nifty50 has been witnessing high volatility.The benchmark index on March 17 started the day flat, taking the clues from its global peers. Later on, as the day progressed prices again underwent strong volatility till the mid-session of the day and finally witnessed a smaller degree horizontal trendline breakdown in the intraday chart and closed below 14,750 with a loss of more than one percent from its previous closing.For the past few trading sessions, the index has been firmly holding above its 21-day exponential moving average (EMA) but due to a brisk sell-off on March 17, it closed below its 21-day EMA on the daily interval, which is mildly negative for the index.On the weekly chart, this current candle has engulfed its previous week's candle and if the index closes below 14,850, bearish engulfing will be formed on the weekly timeframe which will be a negative signal.India VIX has currently settled below 21 level on the daily chart, so we can expect a cooling-off in the volatility in the coming trading sessions.For the past one-month, Bank Nifty has been trading within a consolidation range. On March 17, the banking index witnessed a breakdown of its one-month consolidation and prices also closed below its 21-day EMA on the daily interval.Nifty50 has given a negative breakdown so every uptick in the index should be utilised for a fresh shorting opportunity.Nifty will likely face a strong resistance near 14,950 which is capped under a 21-day EMA. On the lower side, support can be seen at 14,400 which is again under the trendline support.Here are two buy and one sell calls for the next 2-3 weeks:ITC | Buy | LTP: Rs 210.60 | Target price: Rs 223 | Stop loss: Rs 204 | Upside: 6%This stock has witnessed a smaller degree rectangle pattern breakout on the daily timeframe and is currently trading above the trendline support.This counter is trading in a higher high higher low formation and is above its upward-rising trendline support on the weekly chart.This stock is trading above its 21 and 50-day EMA on the daily timeframe, which is positive for the prices in the near-term.Momentum oscillator RSI (14) has given a horizontal trendline breakout which was placed at 45 level. Currently, RSI is reading below 50 level with a bullish crossover.Manappuram Finance | Buy | LTP: Rs 159.40 | Target price: Rs 171 | Stop loss: Rs 153 | Upside: 7%On the daily chart, Manappuram Finance has completed &lsquo;bullish AB=CD harmonic pattern&rsquo;; the coordinates of which are:AB of the leg from Rs 185 to Rs 164.55.BC of the leg completed at Rs 180.60 (which is 70.70 percent of AB leg), andCD of the leg completed at Rs 158.85 (which is 141.40 percent of the BC leg).In terms of the candlestick, the price has formed a bullish harami pattern on the daily timeframe. The stock is trading above its 50 and 100- week exponential moving averages on the weekly timeframe.The counter is trading within a rising channel pattern and has currently formed multiple bullish patterns near its lower band of the rising channel pattern.Adani Ports | Sell | LTP: Rs 688.25 | Target price: Rs 640 | Stop loss: Rs 715 | Downside: 7%Adani Ports, on the daily chart, has witnessed a rising channel pattern breakdown and is trading below its trendline resistance.Momentum oscillator RSI (14) has given a horizontal trendline breakdown which was placed at Rs 65 level.Currently, RSI is reading below 60 level with a bearish crossover. The counter has breached its higher high higher low formation in the medium and small-term charts which is negative for the prices for the coming trading sessions.(The author is a technical analyst at Bonanza Portfolio)Disclaimer: The views and investment tips expressed by investment experts on Moneycontrol.com are their own and not that of the website or its management. Moneycontrol.com advises users to check with certified experts before taking any investment decisions.", "articleSection": "Business", "headline": "Hot Stocks | Trading strategies for ITC, Manappuram Finance and Adani Ports", "description": "On the weekly chart, this current candle has engulfed its previous week's candle and if the index closes below 14,850, bearish engulfing will be formed on the weekly timeframe, which will be a negative signal.", "author": "Rohan Patil", "datePublished": "2021-03-18T07:17:06+05:30", "dateModified": "2021-03-18T07:17:06+05:30", "image": {"@context": "https://schema.org", "@type": "ImageObject", "width": "630px", "height": "354px", "url": "https://images.moneycontrol.com/static-mcnews/2021/03/Podcast-4-770x433.jpg"}, "publisher": {"@context": "https://schema.org", "@type": "Organization", "name": "Moneycontrol", "logo": {"@context": "https://schema.org", "@type": "ImageObject", "width": "247px", "height": "94px", "url": "https://images.moneycontrol.com/images/common/header/logo.png"}, "url": "https://www.moneycontrol.com"}}], "author": {"name": "Rohan Patil", "designation": "Contributor|. "}, "title": "Hot Stocks | Trading strategies for ITC, Manappuram Finance and Adani Ports", "description": "On the weekly chart, this current candle has engulfed its previous week's candle and if the index closes below 14,850, bearish engulfing will be formed on the weekly timeframe, which will be a negative signal.", "published_at": " March 18, 2021  / 07:17 AM IST  ", "tags": [{"name": "#Hot Stocks", "link": "https://www.moneycontrol.com/news/tags/hot-stocks.html"}, {"name": "#markets", "link": "https://www.moneycontrol.com/news/tags/markets.html"}, {"name": "#Nifty", "link": "https://www.moneycontrol.com/news/tags/nifty.html"}, {"name": "#Podcast", "link": "https://www.moneycontrol.com/news/tags/podcast.html"}, {"name": "#Stocks Views", "link": "https://www.moneycontrol.com/news/tags/stocks-views.html"}], "related_stories": [{"link": "https://www.moneycontrol.com/news/business/markets/hot-stocks-mm-financial-services-and-piramal-enterprises-can-give-up-to-16-return-in-short-term-7495481.html", "title": "Hot Stocks | M&M Financial Services and Piramal Enterprises can give up to 16% return in short term"}, {"link": "https://www.moneycontrol.com/news/business/markets/hot-stocks-canara-bank-concor-and-hdfc-amc-are-good-short-term-bets-heres-why-7445871.html", "title": "Hot Stocks | Canara Bank, Concor and HDFC AMC are good short-term bets, here's why"}, {"link": "https://www.moneycontrol.com/news/business/markets/hot-stocks-can-bet-on-britannia-mm-financial-services-torrent-power-for-short-term-7417731.html", "title": "Hot Stocks | Can bet on Britannia, M&M Financial Services, Torrent Power for short term"}], "moneycontrol_stock_ids": null, "calls_data": [{"call_type": "buy", "stock_name": "ITC ", "ltp": "210.60", "target": "223", "stop_loss": "204", "upside_potential": " Upside: 6%"}, {"call_type": "buy", "stock_name": "Manappuram Finance ", "ltp": "159.40", "target": "171", "stop_loss": "153", "upside_potential": " Upside: 7%"}, {"call_type": "sell", "stock_name": "Adani Ports ", "ltp": "688.25", "target": "640", "stop_loss": "715", "upside_potential": " Downside: 7%"}]}