{"metadata": [{"@context": "https://schema.org", "mainEntityOfPage": "https://www.moneycontrol.com/news/business/markets/hot-stocks-divis-labs-sbi-and-ashok-leyland-three-trading-ideas-for-the-short-term-6690071.html", "@type": "NewsArticle", "url": "https://www.moneycontrol.com/news/business/markets/hot-stocks-divis-labs-sbi-and-ashok-leyland-three-trading-ideas-for-the-short-term-6690071.html", "articleBody": "For the last couple of weeks, Nifty has been witnessing super volatility, facing a strong tug of war between bulls and bears. On March 24, the bears won.In the previous session, the benchmark index started with a small cut, taking cues from its global peers. Later, as the day progressed, losses increased and bear dominated in the last hour of trade.The Nifty is indicating the unfolding of the last wave of correction where the probable structure is 3-3-5. And currently, the third wave of the last leg is in progress.In the past few trading sessions, the index has shown respect to the 50-EMA and the slop of 50-EMA is also flat. But, yesterday it broke and closed below 50-EMA. Yesterday's close was the lowest in March.On the weekly chart, there was an evening star kind of pattern till the last week wherein follow-up selling could be witnessed in a coming couple of trading sessions.On the verge of monthly expiry, one can expect the lower levels of last week of 14,350 may be tested.India VIX has currently settled below 22.45 on the daily chart so we can expect high volatility in the coming trading sessions.The Bank Nifty, too, has given a breakdown below 34,000 and yesterday's sell-off is adding to the confirmation that bears have&nbsp;the upper hand.Nifty has given a negative breakdown so every uptick in the index should be utilised for a fresh shorting opportunity.The index will likely face a strong resistance near 14,750-14,850 levels which is capped under a 21-day EMA. On the lower side, support can be seen at 14,350 which is again under the brace of the trendline support.Here is one buy and two sell calls for the next 2-3 weeks:Divi's Laboratories | Buy | LTP: Rs 3,482 | Target price: Rs 3,710 | Stop loss: Rs 3,370 | Upside: 7%This stock has shown strong support around the Rs 3,200-3,300 range.It managed to get back above 20 EMA. RSI managed to get above the oversold zone and is now quoting at 50.The stock is also outperforming Nifty on a daily basis. The Central Pivot range also shifted to the higher side which is given additional confirmation to the bulls.The eight-day rolling pivot has also crossed with strong momentum in the last couple of days.So, on multiple grounds, the stock is showing the momentum is coming back and a sharp bounce back from the demand zone indicated that the supply zone near Rs 3,710 will be tested in the coming few days.State Bank of India (SBI) | Sell | LTP: Rs 360.10 | Target price: Rs 334 | Stop loss: Rs 371 | Downside: 7%On the weekly chart, SBI had created an inverted hammer in the second week of February and it has consistently shown profit-booking so far.On the daily basis, it has created a head and shoulder pattern with a neckline at Rs 384. The neckline is broken and the gap of Rs 358-384 is filled by the SBI.Currently, SBI is showing further supply and if broken below Rs 357, the major demand zone is placed at Rs 334 level.Ashok Leyland | Sell | LTP: Rs 112.45 | Target price: Rs 96 | Stop loss: Rs 117 | Downside: 15%On the daily chart, post-bearish diversions on RSI last month, Ashok Leyland has corrected from Rs 138 to Rs 109.It did some failed attempts to cross Rs 121 but was not able to hold it. It is underperforming Nifty and showing small indications of reversals.This stock is sustaining well below 50 DEMA and 20 DEMA and 8 days rolling pivot too.Due to recent correction, the slop of 20 DEMA is bearish and 50 DEMA is flattish. It is an indication of upcoming downticks on the counter.The stock has already retraced 23.60 percent at Rs 109 and if sustains below it, the next level of retrace is 38.40 percent of the current rally from Rs 33 level i.e. Rs 98.(The author is Head Of Research at Bonanza Portfolio)Disclaimer: The views and investment tips expressed by investment experts on Moneycontrol.com are their own and not that of the website or its management. Moneycontrol.com advises users to check with certified experts before taking any investment decisions.", "articleSection": "Business", "headline": "Hot Stocks | Divi's Labs, SBI and Ashok Leyland three trading ideas for the short term", "description": "India VIX has currently settled below 22.45 on the daily chart so we can expect high volatility in the coming trading sessions.", "author": "Vishal Wagh", "datePublished": "2021-03-25T07:15:24+05:30", "dateModified": "2021-03-25T07:15:24+05:30", "image": {"@context": "https://schema.org", "@type": "ImageObject", "width": "630px", "height": "354px", "url": "https://images.moneycontrol.com/static-mcnews/2021/03/Stocks.Unsplash-2-770x433.jpg"}, "publisher": {"@context": "https://schema.org", "@type": "Organization", "name": "Moneycontrol", "logo": {"@context": "https://schema.org", "@type": "ImageObject", "width": "247px", "height": "94px", "url": "https://images.moneycontrol.com/images/common/header/logo.png"}, "url": "https://www.moneycontrol.com"}}], "author": {"name": "Vishal Wagh", "designation": "Head of Research|Bonanza Portfolio Ltd. "}, "title": "Hot Stocks | Divi's Labs, SBI and Ashok Leyland three trading ideas for the short term", "description": "India VIX has currently settled below 22.45 on the daily chart so we can expect high volatility in the coming trading sessions.", "published_at": " March 25, 2021  / 07:15 AM IST  ", "tags": [{"name": "#Hot Stocks", "link": "https://www.moneycontrol.com/news/tags/hot-stocks.html"}, {"name": "#Nifty", "link": "https://www.moneycontrol.com/news/tags/nifty.html"}, {"name": "#Stocks Views", "link": "https://www.moneycontrol.com/news/tags/stocks-views.html"}], "related_stories": [{"link": "https://www.moneycontrol.com/news/business/ipo/how-grey-market-premium-is-relevant-in-the-current-market-scenario-7320161.html", "title": "How grey market premium is relevant in the current market scenario"}, {"link": "https://www.moneycontrol.com/news/business/ipo/here-is-why-so-many-companies-are-going-public-now-7188531.html", "title": "Here is why so many companies are going public now?"}, {"link": "https://www.moneycontrol.com/news/business/markets/hot-stocks-tata-steel-icici-bank-are-two-trading-ideas-for-the-short-term-7044551.html", "title": "Hot Stocks | 'Tata Steel, ICICI Bank are two trading ideas for the short term'"}], "moneycontrol_stock_ids": null, "calls_data": [{"call_type": "buy", "stock_name": "Divi's Laboratories ", "ltp": "3482", "target": "3710", "stop_loss": "3370", "upside_potential": " Upside: 7%"}, {"call_type": "sell", "stock_name": "State Bank of India (SBI) ", "ltp": "360.10", "target": "334", "stop_loss": "371", "upside_potential": " Downside: 7%"}, {"call_type": "sell", "stock_name": "Ashok Leyland ", "ltp": "112.45", "target": "96", "stop_loss": "117", "upside_potential": " Downside: 15%"}]}