{"metadata": [{"@context": "https://schema.org", "mainEntityOfPage": "https://www.moneycontrol.com/news/business/markets/hot-stocks-pi-industries-tata-chemicals-could-give-over-10-return-in-short-term-6745491.html", "@type": "NewsArticle", "url": "https://www.moneycontrol.com/news/business/markets/hot-stocks-pi-industries-tata-chemicals-could-give-over-10-return-in-short-term-6745491.html", "articleBody": "Nifty50 on the weekly time frame has been in a consolidation mode for the past four weeks and has managed to hold above the 20-week SMA on a closing basis.On the daily time frame, we can see the prices hovering around the 20-Day SMA. On the options open interest front (15 April 2021 expiry), huge participation and open interest addition are seen in the 15,200 Call.On the Put side, open interest addition and participation were seen in the 14500 Put contracts. Thus, going ahead, we can expect the broader range of the Nifty to be between 14500-15200.On the technical&nbsp;front, the ADX plotted on the weekly time frame can be seen moving lower, indicating a lack of strength, as the index moves in a sideways range.On the upside, the key resistance levels are 15000-15050, if the index sustains above this level, we might see the index head higher towards 15220-15430 (resistance zone and Previous swing high).The key support level for Nifty in the short term is 14600, followed by 14264, which is the 3 week low.To sum it all up, currently, the index seems to be moving in a range. The key level to watch for on the upside is 15000-15050. If the index breaks above this level, we can expect acceleration in the bullish momentum that will take the prices towards 15220-15430.The above analysis will not hold true if the index breaches and closes below the 14600 mark. If this level is breached, we might see the index move lower and test 14260.Here is a list of top stocks ideas for the next 3-4 weeks based on the closing price of 8 April:Navin Fluorine International: Buy | LTP: Rs 3047 | Target: Rs 3153 | Stop Loss: Rs 2846 | Upside 4%Navin Fluorine on the monthly time frame can be seen forming a higher high higher low pattern since October 2020. For the past 20 weeks, the stock has been moving in a range.This up move was backed by above-average volume, indicating participation as the price&rsquo;s breakout of a consolidation.On the&nbsp;technical front, RSI on the weekly time frame is placed above the 50 levels and is moving higher, indicating the presence of momentum in the bullish trend.The Bollinger band plotted on the weekly time frame too can be seen expanding as the prices moves higher, indicating expanding volatility. Going ahead, the key resistance is placed at Rs 3153 (50% extension level of the rise from&nbsp;Rs&nbsp;977-2850), followed by&nbsp;Rs&nbsp;3374 (61.8% extension level of the rise from&nbsp;Rs&nbsp;977-2850).The key level to watch for on the downside is&nbsp;Rs 2846 (Multiple touchpoint level) followed by&nbsp;Rs&nbsp;2217 (Swing low).Looking at the prices action and the technical parameters mentioned above we expect the prices to move higher towards&nbsp;Rs&nbsp;3153 followed by&nbsp;Rs&nbsp;3374.Our bullish view will be negated if the prices moves below&nbsp;Rs&nbsp;2846. If the prices manage to sustain below this level, we might see the stock move lower towards the&nbsp;Rs&nbsp;2217 mark.PI Industries: Buy | LTP: Rs 2517|&nbsp; Target: Rs 2820 | Stop Loss: Rs 2190 | Upside 12%PI Industries on the monthly time frame can be seen maintaining the higher high higher low pattern. On the weekly time frame, the stock broke above the 9-week consolidation and has sustained above the upper range of the consolidation.This breakout from the 9-week consolidation was backed by above-average volume, indicating participation in the up move. On the&nbsp;technical&nbsp;front, RSI on the weekly time frame is placed above the 50 levels and is moving higher, indicating the presence of momentum in the bullish trend.Going ahead the immediate resistance is placed at Rs 2622-2650 (38.2% extension level of the rise from 1&nbsp;Rs&nbsp;589-2650) followed by&nbsp;Rs&nbsp;2820 (50% extension level of the rise from&nbsp;Rs&nbsp;1589-2650).The key support levels are&nbsp;Rs&nbsp;2300 and&nbsp;Rs&nbsp;2201-2190 (weekly low) level. Based on the above-mentioned parameters and the prices action, we expect the stock to move higher and test the&nbsp;Rs&nbsp;2600 mark, if the prices manage to sustain above this level, we might see further up move till&nbsp;Rs&nbsp;2820.Tata Chemicals: Buy | LTP: Rs 821 | Target: Rs 948 | Stop Loss: Rs 748 | Upside 15%Tata Chemicals on the monthly time frame can be seen forming a higher high higher low pattern since November 2020. For the past five weeks, the stock has been moving in a range between&nbsp;Rs&nbsp;690-795.This up move was backed by above-average volume, indicating participation as the prices break out of a consolidation. On the&nbsp;technical&nbsp;front, RSI on the weekly time frame is placed above the 50 levels and is moving higher, indicating the presence of momentum in the bullish trend.The Bollinger band plotted on the daily time frame too can be seen expanding as the prices move higher, indicating expanding volatility as the prices move higher.Going ahead the key resistance is placed at Rs 893 (61.8% extension level of the rise from&nbsp;Rs&nbsp;466-79), followed by&nbsp;Rs&nbsp;948 (78.6% extension level of the rise from&nbsp;Rs&nbsp;466-795).The key level to watch for on the downside is&nbsp;Rs&nbsp;789 followed by&nbsp;Rs&nbsp;748. Looking at the prices action and the technical parameters mentioned above we expect the prices to move higher towards&nbsp;Rs&nbsp;893 followed by&nbsp;Rs&nbsp;948. Our bullish view will be negated if the prices move below&nbsp;Rs&nbsp;748.Disclaimer: The views and investment tips expressed by investment experts on Moneycontrol.com are their own and not that of the website or its management. Moneycontrol.com advises users to check with certified experts before taking any investment decisions.", "articleSection": "Business", "headline": "Hot Stocks: PI Industries &amp;amp; Tata Chemicals could give over 10% return in short term", "description": "The key support level for Nifty in the short term is 14600, followed by 14264, which is the 3 week low.", "author": "Kshitij Anand", "datePublished": "2021-04-09T07:31:45+05:30", "dateModified": "2021-04-09T07:31:45+05:30", "image": {"@context": "https://schema.org", "@type": "ImageObject", "width": "630px", "height": "354px", "url": "https://images.moneycontrol.com/static-mcnews/2020/11/Buy_2-770x433.jpg"}, "publisher": {"@context": "https://schema.org", "@type": "Organization", "name": "Moneycontrol", "logo": {"@context": "https://schema.org", "@type": "ImageObject", "width": "247px", "height": "94px", "url": "https://images.moneycontrol.com/images/common/header/logo.png"}, "url": "https://www.moneycontrol.com"}}], "author": {"name": "Kshitij Anand", "designation": "Technical Analyst - Equities|GEPL Capital "}, "title": "Hot Stocks: PI Industries & Tata Chemicals could give over 10% return in short term", "description": "The key support level for Nifty in the short term is 14600, followed by 14264, which is the 3 week low.", "published_at": " April 09, 2021  / 07:31 AM IST  ", "tags": [{"name": "#Hot Stocks", "link": "https://www.moneycontrol.com/news/tags/hot-stocks.html"}, {"name": "#Karan Pai", "link": "https://www.moneycontrol.com/news/tags/karan-pai.html"}, {"name": "#Market Edge", "link": "https://www.moneycontrol.com/news/tags/market-edge.html"}, {"name": "#MARKET OUTLOOK", "link": "https://www.moneycontrol.com/news/tags/market-outlook.html"}, {"name": "#Nifty", "link": "https://www.moneycontrol.com/news/tags/nifty.html"}, {"name": "#Sensex", "link": "https://www.moneycontrol.com/news/tags/sensex.html"}, {"name": "#stock recommendations", "link": "https://www.moneycontrol.com/news/tags/stock-recommendations.html"}, {"name": "#Technical Recommendations", "link": "https://www.moneycontrol.com/news/tags/technical-recommendations.html"}], "related_stories": [{"link": "https://www.moneycontrol.com/news/business/markets/hot-stocks-can-bet-on-hdfc-twins-bandhan-bank-for-double-digit-returns-7557221.html", "title": "Hot Stocks: 'Can bet on HDFC twins, Bandhan Bank for double-digit returns'"}, {"link": "https://www.moneycontrol.com/news/business/markets/hot-stocks-can-fin-homes-ongc-and-itc-can-give-15-28-returns-in-short-term-7499541.html", "title": "Hot Stocks | Can Fin Homes, ONGC and ITC can give 15-28% returns in short term"}, {"link": "https://www.moneycontrol.com/news/business/markets/nifty-range-for-the-weeks-ahead-and-three-stocks-that-can-give-up-to-22-return-7449821.html", "title": "Nifty range for the weeks ahead, and three stocks that can give up to 22% return"}], "moneycontrol_stock_ids": null, "calls_data": [{"call_type": "buy", "stock_name": "Navin Fluorine International: Buy ", "ltp": "3047", "target": "3153", "stop_loss": "2846", "upside_potential": " Upside 4%"}]}