{"metadata": [{"@context": "https://schema.org", "mainEntityOfPage": "https://www.moneycontrol.com/news/business/markets/hot-stocks-heres-why-ongc-is-a-buy-and-hcl-tech-is-a-sell-for-the-short-term-6841601.html", "@type": "NewsArticle", "url": "https://www.moneycontrol.com/news/business/markets/hot-stocks-heres-why-ongc-is-a-buy-and-hcl-tech-is-a-sell-for-the-short-term-6841601.html", "articleBody": "Trading for the week started on a positive note on April 26 and as the week progressed, the recovery mode started.Before anyone could realize it, Nifty and Bank Nifty were back to 15,000 and 34,000, respectively. Everything looked hunky-dory and appeared as if we are headed higher now.But, market participants became a bit tentative around these psychological levels, which eventually resulted in a sharp decline on April 30.Despite this, the week ended with more than 2 percent gains for the Nifty.The market seems to be in a deceptive mode as it first caught bears on the wrong foot after surpassing 14,750 and now with the tail-end correction, the bulls are completely clueless and unsure of the next move.Such a market is literally a nightmare for the swing traders as the market is unable to see any kind of follow-up move.Hence, looking at all this, it is quite clear that the benchmark is trapped in a wider range of 1000 points i.e. 15,000 &ndash; 14,150 and till the time we do not see a sustainable breakout on either side, we would like to remain neutral on market and would like to consider each day as a new day.Within this consolidation, the inclination would slightly be on the positive side as we are seeing a strong support zone of 14,550 &ndash; 14,450.Here the banking index holds some significance as long as 32,000 remain intact. For Nifty, the immediate resistances are to be seen at 14,730 &ndash; 14,860.Let us see how the action unfolds as we step into May month. There is a famous old saying on market &lsquo;Sell in May and Go away'.In recent years, the market has proved it incorrect and participants would certainly be hoping for the same. The only critical observation here is the overall placement of the &lsquo;Nifty Midcap50&rsquo; index.Recently, we had mentioned the breakdown from the &lsquo;Head and Shoulder&rsquo; pattern on the daily chart and despite the recent recovery, we can see it facing resistance around the confluence point of the neckline and the &lsquo;Falling trend Line&rsquo; levels of 6,850 &ndash; 6,900.Till the time these levels are not surpassed, avoid aggressive bets and focus only on individual themes in the market.Here is a list of stocks for the week: ONGC: Buy| LTP: Rs 108| Target: Rs 115| Stop Loss: Rs 103| Upside 6%On Friday, a lot of PSU stocks kept buzzing throughout the day. In this space, ONGC has been one of our preferred stocks which of late saw some price-wise as well as time correction.For nearly 3-4 weeks, stock prices rested around the daily &rsquo;89 EMA&rsquo; as well as key Fibonacci retracement levels.On Friday, the counter surged along with reasonable higher volumes, indicating possible resumption of the higher degree uptrend.We recommend going long for a target of Rs 115 in the coming days. The strict stop loss can be placed at Rs 103.HCL Technologies: Sell| LTP: Rs 899| Target: Rs 855| Stop Loss: Rs 928| Downside 5%Since the last few days, the heavyweight IT space has taken a back seat and in fact, some of the heavyweight stocks have gone through some decent price-wise correction.From this pack, HCL Technologies is the weakest counter as it is convincingly trading below its key short-term moving averages placed around 940. The price structure on the weekly time frame also does not bode well for the bulls.One can look to sell on any bounce for a short-term target of Rs.855. Since this space is known for its tremendous outperformance over the years, one must have a proper exit strategy for shorting positions. In this case, the stop loss can be placed at Rs.928.(The author is chief analyst-technical &amp;amp;amp; derivatives, Angel Broking)Disclaimer: The views and investment tips expressed by the investment experts on Moneycontrol.com are his own and not that of the website or its management. Moneycontrol.com advises users to check with certified experts before taking any investment decisions.", "articleSection": "Business", "headline": "Hot Stocks | Here's why ONGC is a buy and HCL Tech is a sell for the short term", "description": "With its deceptive moves, the market is keeping traders on the edge. Can the famous saying &lsquo;Sell in May and Go away' be true this time? Read on to know Sameet Chavan's views and his top bets right now", "author": "Sameet Chavan", "datePublished": "2021-05-03T07:31:00+05:30", "dateModified": "2021-05-03T07:31:00+05:30", "image": {"@context": "https://schema.org", "@type": "ImageObject", "width": "630px", "height": "354px", "url": "https://images.moneycontrol.com/static-mcnews/2020/11/Buy_2-770x433.jpg"}, "publisher": {"@context": "https://schema.org", "@type": "Organization", "name": "Moneycontrol", "logo": {"@context": "https://schema.org", "@type": "ImageObject", "width": "247px", "height": "94px", "url": "https://images.moneycontrol.com/images/common/header/logo.png"}, "url": "https://www.moneycontrol.com"}}], "author": {"name": "Sameet Chavan", "designation": "Chief Analyst- Technicals & Derivatives|Angel Broking "}, "title": "Hot Stocks | Here's why ONGC is a buy and HCL Tech is a sell for the short term", "description": "With its deceptive moves, the market is keeping traders on the edge. Can the famous saying ‘Sell in May and Go away' be true this time? Read on to know Sameet Chavan's views and his top bets right now", "published_at": " May 03, 2021  / 07:31 AM IST  ", "tags": [{"name": "#Angel Broking", "link": "https://www.moneycontrol.com/news/tags/angel-broking.html"}, {"name": "#Hot Stocks", "link": "https://www.moneycontrol.com/news/tags/hot-stocks.html"}, {"name": "#Market Edge", "link": "https://www.moneycontrol.com/news/tags/market-edge.html"}, {"name": "#MARKET OUTLOOK", "link": "https://www.moneycontrol.com/news/tags/market-outlook.html"}, {"name": "#Nifty", "link": "https://www.moneycontrol.com/news/tags/nifty.html"}, {"name": "#Podcast", "link": "https://www.moneycontrol.com/news/tags/podcast.html"}, {"name": "#Sameet Chavan", "link": "https://www.moneycontrol.com/news/tags/sameet-chavan.html"}, {"name": "#Sensex", "link": "https://www.moneycontrol.com/news/tags/sensex.html"}, {"name": "#stock recommendations", "link": "https://www.moneycontrol.com/news/tags/stock-recommendations.html"}, {"name": "#Technical Recommendations", "link": "https://www.moneycontrol.com/news/tags/technical-recommendations.html"}], "related_stories": [{"link": "https://www.moneycontrol.com/news/business/markets/hot-stocks-here-is-why-you-should-buy-cigniti-tech-and-sell-sbi-life-insurance-7566351.html", "title": "Hot Stocks | Here is why you should buy Cigniti Tech and sell SBI Life Insurance"}, {"link": "https://www.moneycontrol.com/news/business/markets/hot-stocks-here-is-why-you-should-buy-kirloskar-ferrous-and-sell-tcs-7535271.html", "title": "Hot Stocks | Here is why you should buy Kirloskar Ferrous and sell TCS"}, {"link": "https://www.moneycontrol.com/news/business/markets/hot-stocks-heres-why-you-should-buy-blue-star-ongc-but-sell-jubilant-foodworks-7508941.html", "title": "Hot Stocks | Here's why you should buy Blue Star, ONGC but sell Jubilant FoodWorks"}], "moneycontrol_stock_ids": null, "calls_data": [{}, {}]}