{"metadata": [{"@context": "https://schema.org", "mainEntityOfPage": "https://www.moneycontrol.com/news/business/markets/hot-stocks-graphite-india-kajaria-ceramics-globus-spirits-can-give-10-17-return-in-short-term-6998561.html", "@type": "NewsArticle", "url": "https://www.moneycontrol.com/news/business/markets/hot-stocks-graphite-india-kajaria-ceramics-globus-spirits-can-give-10-17-return-in-short-term-6998561.html", "articleBody": "After a pause last Friday, Nifty resumed its upward journey on&nbsp;June 7 where it gained 81 points to close at a new all-time high level of 15,752.With intermediate and long-term momentum readings like the 14-week and 14-month RSI (Relative Strength Index) in rising mode and not showing any signs of negative divergence, we expect the uptrend to continue.Also, plus-DMI (Directional Movement Index) is placed above the minus-DMI while the ADX is placed above 25 level with slopping upwards, indicating Nifty could continue its upward journey in the near term.Nifty continues to form bullish higher top higher bottom formation on the weekly and monthly chart. The 14-month RSI is at 73 level and is not extremely overbought, which suggests scope for more upsides in the coming weeks.In the Options segment, we have seen Put writing at 15,400-15,500 levels. During the recent correction, Nifty made a swing low of 15,460 while previous resistance of 15,432 will now interchange its role as a support.Therefore, there are multiple pieces of evidence that suggest strong support in the range of 15,400-15,500 levels. We believe that the short-term trend will remain intact as long as Nifty is trading above the support level of 15,400.A short-term trend reversal would be confirmed only if the Nifty closes below 15,400.Immediate targets for the Nifty are seen at 16,000-16,100 levels derived from the channel breakout on the weekly chart.Nifty Midcap and Smallcap indices outperformed on Monday by gaining 1.2 percent and 1.5 percent, respectively. This calendar year, so far, they have outperformed by rising 29 percent and 36 percent, respectively, against a 13 percent rise in the Nifty.We believe that there is still&nbsp;some upside for mid and small-cap stocks.Here are three buy recommendations from the mid and small-cap segments for the next 2-3 weeks:Graphite India | LTP: Rs 779.50 | Target price: Rs 860 | Stop loss: Rs 737 | Upside: 10%This stock has broken out on the daily chart with higher volumes to close at the highest level since May 25.Before rising, the stock formed a strong base around Rs 740 by taking support multiple times around that level.RSI is in rising mode and placed above 60 Indicating strength in the current uptrend.Plus DI is placed above the minus DI while the ADX is in rising mode and crossed 20 level from the low, indicating the stock is likely to gather momentum.Kajaria Ceramics | LTP: Rs 992.90 | Target price: Rs 1,120 | Stop loss: Rs 940 | Upside: 13%This stock has already broken out on the daily chart on June 3 to close at an all-time high.RSI is in rising mode and placed above 60, indicating strength in the uptrend.Plus DI is placed above the minus DI while the ADX is in rising mode and placed above 25 level, indicating momentum in the current uptrend.Sideways movement of the last two days is a buying opportunity as the stock is in a strong uptrend.Globus Spirits | LTP: Rs 360 | Target price: Rs 422 | Stop loss: Rs 330 | Upside: 17%This stock has broken out from the downward sloping trendline, adjoining the highs of February 9 and May 27, 2021, on the daily chart with higher volumes to close at the highest level since February 24.Accumulation is visible in the stocks in the last few days where volumes are higher on up days compared to down days.Before the up move, the stock formed a strong base around Rs 305 by taking support multiple times around that level.Oscillators like RSI and MFI are showing strength in the current uptrend of the stock.(The author is a technical research analyst at HDFC Securities)Disclaimer: The views and investment tips expressed by investment experts on Moneycontrol.com are their own and not that of the website or its management. Moneycontrol.com advises users to check with certified experts before taking any investment decisions.", "articleSection": "Business", "headline": "Hot Stocks | Graphite India, Kajaria Ceramics, Globus Spirits can give 10-17% return in short term", "description": "Nifty Midcap and Smallcap indices outperformed on June 7 by gaining 1.2 percent and 1.5 percent, respectively. Nandish Shah of HDFC Securities believes there is still some upside for the stocks in this space", "author": "Nandish Shah", "datePublished": "2021-06-08T07:43:32+05:30", "dateModified": "2021-06-08T08:29:29+05:30", "image": {"@context": "https://schema.org", "@type": "ImageObject", "width": "630px", "height": "354px", "url": "https://images.moneycontrol.com/static-mcnews/2021/06/Stocks-770x433.jpg"}, "publisher": {"@context": "https://schema.org", "@type": "Organization", "name": "Moneycontrol", "logo": {"@context": "https://schema.org", "@type": "ImageObject", "width": "247px", "height": "94px", "url": "https://images.moneycontrol.com/images/common/header/logo.png"}, "url": "https://www.moneycontrol.com"}}], "author": {"name": "Nandish Shah", "designation": "Senior Derivative and Technical Analyst|HDFC securities "}, "title": "Hot Stocks | Graphite India, Kajaria Ceramics, Globus Spirits can give 10-17% return in short term", "description": "Nifty Midcap and Smallcap indices outperformed on June 7 by gaining 1.2 percent and 1.5 percent, respectively. Nandish Shah of HDFC Securities believes there is still some upside for the stocks in this space", "published_at": " June 08, 2021  / 08:29 AM IST  ", "tags": [{"name": "#Hot Stocks", "link": "https://www.moneycontrol.com/news/tags/hot-stocks.html"}, {"name": "#markets", "link": "https://www.moneycontrol.com/news/tags/markets.html"}, {"name": "#Nifty", "link": "https://www.moneycontrol.com/news/tags/nifty.html"}, {"name": "#Podcast", "link": "https://www.moneycontrol.com/news/tags/podcast.html"}, {"name": "#Stocks Views", "link": "https://www.moneycontrol.com/news/tags/stocks-views.html"}], "related_stories": [{"link": "https://www.moneycontrol.com/news/business/markets/hot-stocks-can-bet-on-vip-industries-rupa-company-glenmark-pharma-for-10-15-gains-in-short-term-7571041.html", "title": "Hot Stocks | 'Can bet on VIP Industries, Rupa & Company, Glenmark Pharma for 10-15% gains in short term'"}, {"link": "https://www.moneycontrol.com/news/business/markets/hot-stocks-phillips-carbon-black-jb-chemicals-godrej-industries-can-give-up-to-12-return-in-short-term-7514621.html", "title": "Hot Stocks | Phillips Carbon Black, JB Chemicals, Godrej Industries can give up to 12% return in short term"}, {"link": "https://www.moneycontrol.com/news/business/markets/hot-stocks-can-bet-on-rhi-magnesita-india-century-plyboards-rpsg-ventures-for-short-term-7462251.html", "title": "Hot Stocks | 'Can bet on RHI Magnesita India, Century Plyboards, RPSG Ventures for short term'"}], "moneycontrol_stock_ids": null, "calls_data": [{"call_type": "buy", "stock_name": "Graphite India ", "ltp": "779.50", "target": "860", "stop_loss": "737", "upside_potential": " Upside: 10%"}, {"call_type": "buy", "stock_name": "Kajaria Ceramics ", "ltp": "992.90", "target": "1120", "stop_loss": "940", "upside_potential": " Upside: 13%"}, {"call_type": "buy", "stock_name": "Globus Spirits ", "ltp": "360", "target": "422", "stop_loss": "330", "upside_potential": " Upside: 17%"}]}