{"metadata": [{"@context": "https://schema.org", "mainEntityOfPage": "https://www.moneycontrol.com/news/business/markets/hot-stocks-heres-why-oberoi-realty-motilal-oswal-financial-services-and-avenue-supermarts-are-short-term-buys-7034091.html", "@type": "NewsArticle", "url": "https://www.moneycontrol.com/news/business/markets/hot-stocks-heres-why-oberoi-realty-motilal-oswal-financial-services-and-avenue-supermarts-are-short-term-buys-7034091.html", "articleBody": "Nifty managed to hold above the previous swing low of 15,566. It closed at its new all-time high on June 14.Bank Nifty ended the session with a bullish hammer candlestick pattern on the daily chart. It found support on the upward sloping trendline, adjoining the daily lows of April 22 and May 14, 2021.Nifty Midcap and small-cap indices also managed to hold above important support levels.As far as Nifty's upside is concerned, it may reach the target of 16,000-16,200 in a short span of time. The support would continue to be at 15,566 on a closing basis. Bank Nifty should be held long with a stop loss of 34,374. Upside targets for Bank Nifty are seen at 35,810 and 36,500.Bank, auto and realty indices, which have not contributed to the recent strength of the Nifty, are expected to see sharp short-covering in the coming days.The sectors which have been outperforming and still can do well are power, PSU and capital goods space.From the mid-cap segment, auto ancillary, metal and IT stocks should be kept on the radar for short to medium-term gains.Though bulls are completely dominating the current market trend, we should not get carried away, as more than 94 percent of the NSE500 stocks have now reached above their 200-day moving average. If we were to go by the historical bull market rallies, this number suggests extreme and mean-reverting breadth from the overbought zone.Nifty Smallcap index has surged two-fold from the March 2020 bottom. So from here, stock selection should be done very carefully and fresh trades should be taken with appropriate risk management strategies.Stop loss in trading positions should be kept on a trailing basis.Here are three buy calls for the next 2-3 weeks:Oberoi Realty | LTP: Rs 657.60 | Target price: Rs 780 | Stop loss: Rs 600 | Upside: 19%On June 3, this stock surpassed the crucial double top resistance of Rs 630 on a closing basis.&nbsp;Volumes have been building up in the stock for the last 3 weeks along with the price rise (signaling strength).The realty sector has started getting traction in the last one month. Oberoi Realty is one of the best-placed stocks in the real estate sector.The stock is placed above all important moving averages, indicating a bullish trend on all timeframes. Indicators and oscillators have turned bullish on the weekly and monthly charts.Motilal Oswal Financial Services | LTP: Rs 799.95 | Target price: Rs 940 | Stop loss: Rs 720 | Upside: 18%This stock is on the verge of breaking out from a bullish flag pattern on the daily chart.It has seen a healthy correction from the previous swing high of Rs 860. The correction has been with very thin volumes which indicates that bulls have enough dominance for the medium term.In May, this stock broke out from the long-term downward sloping channel on the monthly charts.NBFC sector (especially AMCs, exchange and broking companies) has started outperforming in the last couple of months and&nbsp;it&nbsp;is expected to continue.It is placed above the medium to long-term moving averages, indicating a primary uptrend.Indicators and oscillators on the weekly and monthly charts have turned bullish.Avenue Supermarts (D-Mart) | LTP: Rs 3,276.40 | Target price: Rs 3,799 | Stop loss: Rs 3,000 | Upside: 16%It has broken out from the last seven sessions' narrow consolidation. It has also taken out the crucial resistance of its downward sloping trendline on the daily chart.Volumes during the breakout remained significantly higher than its 10-day average volumes.The primary trend of the stock has been bullish as the stock has been forming higher tops and higher bottoms on the daily and weekly charts.It is placed above the medium to long-term moving averages, indicating a bullish trend on all timeframes.Indicators and oscillators on the weekly and monthly charts have turned bullish.(The author is a technical research analyst at HDFC Securities)Disclaimer: The views and investment tips expressed by investment experts on Moneycontrol.com are their own and not that of the website or its management. Moneycontrol.com advises users to check with certified experts before taking any investment decisions.", "articleSection": "Business", "headline": " Hot Stocks | Here's why Oberoi Realty, Motilal Oswal Financial Services and Avenue Supermarts are...", "description": "From the mid-cap segment, auto ancillary, metal and IT stocks should be kept on the radar for short to medium-term gains, said Vinay Rajani of HDFC Securities", "author": "Vinay Rajani", "datePublished": "2021-06-15T07:13:48+05:30", "dateModified": "2021-06-15T07:15:21+05:30", "image": {"@context": "https://schema.org", "@type": "ImageObject", "width": "630px", "height": "354px", "url": "https://images.moneycontrol.com/static-mcnews/2021/06/shutterstock_1043121319-770x433.jpg"}, "publisher": {"@context": "https://schema.org", "@type": "Organization", "name": "Moneycontrol", "logo": {"@context": "https://schema.org", "@type": "ImageObject", "width": "247px", "height": "94px", "url": "https://images.moneycontrol.com/images/common/header/logo.png"}, "url": "https://www.moneycontrol.com"}}], "author": {"name": "Vinay Rajani", "designation": "Technical Research Analyst|HDFC Securities "}, "title": "Hot Stocks | Here's why Oberoi Realty, Motilal Oswal Financial Services and Avenue Supermarts are short-term buys", "description": "From the mid-cap segment, auto ancillary, metal and IT stocks should be kept on the radar for short to medium-term gains, said Vinay Rajani of HDFC Securities", "published_at": " June 15, 2021  / 07:15 AM IST  ", "tags": [{"name": "#Hot Stocks", "link": "https://www.moneycontrol.com/news/tags/hot-stocks.html"}, {"name": "#markets", "link": "https://www.moneycontrol.com/news/tags/markets.html"}, {"name": "#Nifty", "link": "https://www.moneycontrol.com/news/tags/nifty.html"}, {"name": "#Podcast", "link": "https://www.moneycontrol.com/news/tags/podcast.html"}, {"name": "#Stocks Views", "link": "https://www.moneycontrol.com/news/tags/stocks-views.html"}], "related_stories": [{"link": "https://www.moneycontrol.com/news/business/markets/hot-stocks-gujarat-narmada-valley-gsfc-and-tinplate-company-can-give-double-digit-returns-in-short-term-7542981.html", "title": "Hot Stocks | Gujarat Narmada Valley, GSFC and Tinplate Company can give double-digit returns in short term"}, {"link": "https://www.moneycontrol.com/news/business/markets/hot-stocks-you-can-buy-rpg-life-science-beml-but-sell-granules-india-heres-why-7487291.html", "title": "Hot Stocks | Buy RPG Life Science, BEML, but sell Granules India. Here's why"}, {"link": "https://www.moneycontrol.com/news/business/markets/hot-stocks-century-textile-vip-industries-can-fin-homes-can-give-up-to-13-return-in-short-term-7436681.html", "title": "Hot Stocks | Century Textile, VIP Industries, Can Fin Homes can give up to 13% return in short term"}], "moneycontrol_stock_ids": null, "calls_data": [{"call_type": "buy", "stock_name": "Oberoi Realty ", "ltp": "657.60", "target": "780", "stop_loss": "600", "upside_potential": " Upside: 19%"}, {"call_type": "buy", "stock_name": "Motilal Oswal Financial Services ", "ltp": "799.95", "target": "940", "stop_loss": "720", "upside_potential": " Upside: 18%"}, {"call_type": "buy", "stock_name": "Avenue Supermarts (D-Mart) ", "ltp": "3276.40", "target": "3799", "stop_loss": "3000", "upside_potential": " Upside: 16%"}]}