{"metadata": [{"@context": "https://schema.org", "mainEntityOfPage": "https://www.moneycontrol.com/news/business/markets/hot-stocks-can-bet-on-cummins-india-sbi-life-insurance-company-for-short-term-7090241.html", "@type": "NewsArticle", "url": "https://www.moneycontrol.com/news/business/markets/hot-stocks-can-bet-on-cummins-india-sbi-life-insurance-company-for-short-term-7090241.html", "articleBody": "The market managed to register its highest ever weekly close slightly below 15,900 for the week ended June 25.In our previous weekly commentary, we had advocated some caution considering the formation of the hanging man pattern on the weekly chart. To activate this, the prices should have slipped below 15,450, but since it reversed from 15,500, the pattern was not confirmed.Also, we had shared our observation on the placement of the Nifty Midcap 50 index around some crucial levels. All these negative developments have not been completely negated yet, but with the kind of up move we witnessed in Bank Nifty last Friday, the bulls seem to have the upper hand here. Hence, banking becomes a deciding factor going ahead.A follow-up move in the coming sessions may push the Nifty towards its much-awaited milestone of 16,000 which may even extend towards 16,200 later.Hence, it would be interesting to see how things pan out in the banking space. As far as supports for Nifty are concerned, the immediate levels are placed at 15,700 &ndash; 15,670 and the base is to be seen at 15,450 now.As long as the market defends these important supports, the short-term trend remains bullish. But having said that, we would still reiterate that one should avoid being complacent and it&rsquo;s better to continue with the strategy of one step at a time.Although it&rsquo;s difficult to time it, whenever any rally overstretches without giving any meaningful correction, the market tends to surprise you anytime. So to be on the safer side, try to avoid aggressive leveraged positions overnight.Here are two buy calls for the next 2-3 weeks:Cummins India | LTP: Rs 858.80 | Target price: Rs 906 | Stop loss: Rs 823 | Upside: 5.5%This stock has been consolidating with small corrections in between since the beginning of April. Recently, the declining trend seems to have arrested around Rs 750 mark which coincided with the 89-EMA on the daily chart.The stock prices rebounded well from this important support zone and now with Friday&rsquo;s smart-up move, we can see the configuration of a bullish cup and handle on the daily timeframe.Since it&rsquo;s backed by more than average daily volumes, we recommend going long for a short-term target of Rs 906.SBI Life Insurance Company | LTP: Rs 1,007.05 | Target price: Rs 1,058 | Stop loss: Rs 979 | Upside: 5%Life insurance companies have been doing well for the last few months. In fact, they have been holding their ground firmly during the in-between corrective phases the broader market has been experiencing.This stock seems to have cemented its position around Rs 970 &ndash; Rs 950 which is the earlier breakout point.During last week, its peer counters had a good move but this remained quiet. Now looking at Friday&rsquo;s price action, we expect this stock to have some catch-up to its peers.(The author is Chief Technical &amp;amp;amp; Derivatives Analyst at Angel Broking)Disclaimer: The views and investment tips expressed by investment experts on Moneycontrol.com are their own and not that of the website or its management. Moneycontrol.com advises users to check with certified experts before taking any investment decisions.", "articleSection": "Business", "headline": "Hot Stocks | 'Can bet on Cummins India and SBI Life Insurance Company for short term'", "description": "As far as supports for Nifty are concerned, the immediate levels are 15,700 &ndash; 15,670 and the base is at 15,450. As long as the market defends these important supports, the short-term trend remains bullish, said Sameet Chavan of Angel Broking", "author": "Sameet Chavan", "datePublished": "2021-06-28T07:21:14+05:30", "dateModified": "2021-06-28T07:27:45+05:30", "image": {"@context": "https://schema.org", "@type": "ImageObject", "width": "630px", "height": "354px", "url": "https://images.moneycontrol.com/static-mcnews/2021/06/shutterstock_1151323274-770x433.jpg"}, "publisher": {"@context": "https://schema.org", "@type": "Organization", "name": "Moneycontrol", "logo": {"@context": "https://schema.org", "@type": "ImageObject", "width": "247px", "height": "94px", "url": "https://images.moneycontrol.com/images/common/header/logo.png"}, "url": "https://www.moneycontrol.com"}}], "author": {"name": "Sameet Chavan", "designation": "Chief Analyst- Technicals & Derivatives|Angel Broking "}, "title": "Hot Stocks | 'Can bet on Cummins India and SBI Life Insurance Company for short term'", "description": "As far as supports for Nifty are concerned, the immediate levels are 15,700 – 15,670 and the base is at 15,450. As long as the market defends these important supports, the short-term trend remains bullish, said Sameet Chavan of Angel Broking", "published_at": " June 28, 2021  / 07:27 AM IST  ", "tags": [{"name": "#Hot Stocks", "link": "https://www.moneycontrol.com/news/tags/hot-stocks.html"}, {"name": "#markets", "link": "https://www.moneycontrol.com/news/tags/markets.html"}, {"name": "#Nifty", "link": "https://www.moneycontrol.com/news/tags/nifty.html"}, {"name": "#Podcast", "link": "https://www.moneycontrol.com/news/tags/podcast.html"}, {"name": "#Stocks Views", "link": "https://www.moneycontrol.com/news/tags/stocks-views.html"}], "related_stories": [{"link": "https://www.moneycontrol.com/news/business/markets/hot-stocks-here-is-why-you-should-buy-cigniti-tech-and-sell-sbi-life-insurance-7566351.html", "title": "Hot Stocks | Here is why you should buy Cigniti Tech and sell SBI Life Insurance"}, {"link": "https://www.moneycontrol.com/news/business/markets/hot-stocks-here-is-why-you-should-buy-kirloskar-ferrous-and-sell-tcs-7535271.html", "title": "Hot Stocks | Here is why you should buy Kirloskar Ferrous and sell TCS"}, {"link": "https://www.moneycontrol.com/news/business/markets/hot-stocks-heres-why-you-should-buy-blue-star-ongc-but-sell-jubilant-foodworks-7508941.html", "title": "Hot Stocks | Here's why you should buy Blue Star, ONGC but sell Jubilant FoodWorks"}], "moneycontrol_stock_ids": null, "calls_data": [{"call_type": "buy", "stock_name": "Cummins India ", "ltp": "858.80", "target": "906", "stop_loss": "823", "upside_potential": " Upside: 5.5%"}, {"call_type": "buy", "stock_name": "SBI Life Insurance Company ", "ltp": "1007.05", "target": "1058", "stop_loss": "979", "upside_potential": " Upside: 5%"}]}