{"metadata": [{"@context": "https://schema.org", "mainEntityOfPage": "https://www.moneycontrol.com/news/business/markets/hot-stocks-tata-elxsi-csb-bank-and-ccl-products-can-give-up-to-12-return-in-short-term-7098911.html", "@type": "NewsArticle", "url": "https://www.moneycontrol.com/news/business/markets/hot-stocks-tata-elxsi-csb-bank-and-ccl-products-can-give-up-to-12-return-in-short-term-7098911.html", "articleBody": "Nifty registered a new all-time high of 15,915.65 in intraday trade on June 28. However, the index failed to sustain at higher levels and witnessed profit-booking thereafter.For the last five trading sessions, Nifty has been consolidating in a narrow range of 15,700-15,900. This range needs to be taken out on a sustainable basis for the momentum to get back in favour of bulls.Nifty Midcap and Smallcap indices are outperforming the benchmark.The primary trend of the market is bullish, as the Nifty has been holding above its 10, 20, and 50 days moving averages.Maximum Call open interest (OI) on the derivatives side stands at 16,500 while the maximum Put OI stands at 15,500.On the basis of this data, we can expect Nifty to reach a target of 16,500 if it takes out the immediate hurdle of 15,900.Longs should be kept with a stop loss of 15,500. Below 15,500, Nifty would change its trend from bullish to bearish and till that happens traders should take stock and sector-specific bullish bets.From the sectors, banking, IT and pharma are expected to do well from here on.Though bulls are dominating, we should not get carried away, as more than 94 percent of the NSE500 stocks have now reached above their 200 DMA and if we consider historical bull market rallies, this number suggests extreme and mean-reverting breadth from the overbought zone.Nifty Smallcap index has surged two-fold from the March 2020 bottom. So from here, stock selection should be done very carefully and fresh trades should be taken with appropriate risk management strategies.Stop loss in trading positions should be kept on a trailing basis.Nifty may hit 16,300 once the short-term hurdle of 15,900 is taken out. Short-term trend of the Nifty would remain bullish till it holds above 15,500.Here are three buy calls for the next 2-3 weeks:Tata Elxsi | LTP: Rs 3,834 | Target price: Rs 4,150 | Stop loss: Rs 3,600 | Upside: 8%This stock has broken out from the symmetrical triangle with a jump in volumes on the daily charts.Indicators and oscillators on daily and weekly charts have turned bullish. The stock has been finding support near its 20-day EMA support.Moreover, the IT sector has been on an uptrend for many months now and this is expected to continue.CSB Bank | LTP: Rs 358 | Target price: Rs 399 | Stop loss: Rs 328 | Upside: 11%This stock has broken out from the horizontal channel pattern on the daily chart.It has surpassed the double top crucial resistance placed in the range of Rs 344-346.Volumes during the breakout remained significantly higher than its 10-day average volumes.The primary trend of the stock has been bullish as it has been forming higher tops and higher bottoms on the daily and weekly charts.It is placed above the medium to long-term moving averages, indicating a bullish trend on all timeframes. Indicators and oscillators on the daily and weekly charts have turned bullish.CCL Products | LTP: Rs 362.95 | Target price: Rs 405 | Stop loss: Rs 335 | Upside: 12%This stock has broken out from the last seven-session narrow consolidation. A flag pattern breakout is seen with rising volumes on the daily charts.The primary trend of the stock has been bullish as it has been forming higher tops and higher bottoms on the daily and weekly charts.The stock is placed above the medium to long-term moving averages, indicating a bullish trend on all timeframes.Indicators and oscillators on weekly and monthly charts have turned bullish. Moreover, tea, coffee and sugar stocks have been performing very well for the last couple of months.(The author is a technical research analyst at HDFC securities)Disclaimer: The views and investment tips expressed by investment experts on Moneycontrol.com are their own and not that of the website or its management. Moneycontrol.com advises users to check with certified experts before taking any investment decisions.", "articleSection": "Business", "headline": "Hot Stocks | Tata Elxsi, CSB Bank and CCL Products can give up to 12% return in short term", "description": "Nifty may hit 16,300 once the short-term hurdle of 15,900 is taken out. Short-term trend of the Nifty would remain bullish till it holds above 15,500, said Vinay Rajani of HDFC securities", "author": "Vinay Rajani", "datePublished": "2021-06-29T07:15:16+05:30", "dateModified": "2021-06-29T07:16:28+05:30", "image": {"@context": "https://schema.org", "@type": "ImageObject", "width": "630px", "height": "354px", "url": "https://images.moneycontrol.com/static-mcnews/2021/06/Stocks-2-2-770x433.jpg"}, "publisher": {"@context": "https://schema.org", "@type": "Organization", "name": "Moneycontrol", "logo": {"@context": "https://schema.org", "@type": "ImageObject", "width": "247px", "height": "94px", "url": "https://images.moneycontrol.com/images/common/header/logo.png"}, "url": "https://www.moneycontrol.com"}}], "author": {"name": "Vinay Rajani", "designation": "Technical Research Analyst|HDFC Securities "}, "title": "Hot Stocks | Tata Elxsi, CSB Bank and CCL Products can give up to 12% return in short term", "description": "Nifty may hit 16,300 once the short-term hurdle of 15,900 is taken out. Short-term trend of the Nifty would remain bullish till it holds above 15,500, said Vinay Rajani of HDFC securities", "published_at": " June 29, 2021  / 07:16 AM IST  ", "tags": [{"name": "#Hot Stocks", "link": "https://www.moneycontrol.com/news/tags/hot-stocks.html"}, {"name": "#markets", "link": "https://www.moneycontrol.com/news/tags/markets.html"}, {"name": "#Nifty", "link": "https://www.moneycontrol.com/news/tags/nifty.html"}, {"name": "#Podcast", "link": "https://www.moneycontrol.com/news/tags/podcast.html"}, {"name": "#Stocks Views", "link": "https://www.moneycontrol.com/news/tags/stocks-views.html"}], "related_stories": [{"link": "https://www.moneycontrol.com/news/business/markets/hot-stocks-gujarat-narmada-valley-gsfc-and-tinplate-company-can-give-double-digit-returns-in-short-term-7542981.html", "title": "Hot Stocks | Gujarat Narmada Valley, GSFC and Tinplate Company can give double-digit returns in short term"}, {"link": "https://www.moneycontrol.com/news/business/markets/hot-stocks-you-can-buy-rpg-life-science-beml-but-sell-granules-india-heres-why-7487291.html", "title": "Hot Stocks | Buy RPG Life Science, BEML, but sell Granules India. Here's why"}, {"link": "https://www.moneycontrol.com/news/business/markets/hot-stocks-century-textile-vip-industries-can-fin-homes-can-give-up-to-13-return-in-short-term-7436681.html", "title": "Hot Stocks | Century Textile, VIP Industries, Can Fin Homes can give up to 13% return in short term"}], "moneycontrol_stock_ids": null, "calls_data": [{"call_type": "buy", "stock_name": "Tata Elxsi ", "ltp": "3834", "target": "4150", "stop_loss": "3600", "upside_potential": " Upside: 8%"}, {"call_type": "buy", "stock_name": "CSB Bank ", "ltp": "358", "target": "399", "stop_loss": "328", "upside_potential": " Upside: 11%"}, {"call_type": "buy", "stock_name": "CCL Products ", "ltp": "362.95", "target": "405", "stop_loss": "335", "upside_potential": " Upside: 12%"}]}