{"metadata": [{"@context": "https://schema.org", "mainEntityOfPage": "https://www.moneycontrol.com/news/business/markets/hot-stocks-icici-lombard-info-edge-and-igl-top-buy-ideas-heres-why-7109381.html", "@type": "NewsArticle", "url": "https://www.moneycontrol.com/news/business/markets/hot-stocks-icici-lombard-info-edge-and-igl-top-buy-ideas-heres-why-7109381.html", "articleBody": "The Nifty50 continued to trade lower on the daily chart for the third straight day after forming a Bearish Engulfing candlestick pattern on 28th June.It can be observed on the daily chart that the index is forming a smaller degree Rounding Top formation, and it can also be called as distribution phase as prices are moving lower.From the last six trading sessions, the benchmark index is trading in a very narrow range of almost two hundred points without giving any direction bias.But, prices have still managed to close above their 21-day exponential moving average on the daily interval.If we closely observe the PARABOLIC SAR indicator from the last couple of months one can find that whenever the price has declined near the SAR indicator we have seen a strong buying in the index and currently the indicator is placed near 15527 levels on the daily chart.Bank Nifty is underperforming the benchmark index from the last couple of trading sessions and trading in a lower low formation in the intraday chart (30 mins).The banking index on the daily chart is trading above its 50 EMA which is placed at 34400 levels while resistance is placed near 35600 levels.The Nifty50 index is holding the key support zone, but the chart pattern suggests that there might be some action expected in the index if the price remains above the support zone.If the index breaks the crucial resistance zone of 15920-16000 levels in the coming trading sessions then buying will resume again. Support for the index is placed near 15500 levels which are clubbed with a SAR indicator.Here is a list of trading ideas for the next 3-4 weeks:ICICI Lombard General Insurance: Buy| CMP: Rs 1567| Target: Rs 1,648| Stop Loss Rs. 1520| Upside 5%The prices were trading in a range of 1400 to 1530 for almost five months and have formed a Symmetrical Triangle formation on the weekly chart.ICICI Lombard has broken out from a symmetrical triangle pattern at 1598 levels on 28st June and the prices have now registered a decisive breakout that suggests a change in the trend from sideways to upside.The stock is trading above its 21, 50 &amp;amp;amp; 100-days exponential moving averages on the daily time frame, which is positive for the prices in the near term.When we observe volume activity there has been above-average volume on the day of the breakout which confirms price volume breakout on the daily time frame.Momentum oscillator RSI (14) is reading above 60 levels with positive crossover on the daily scale, which indicates the uptrend may resume soon.Info Edge (India) Ltd: Buy| CMP: Rs. 4914| Target Rs 5260 |Stop Loss Rs. 4718|Return 7%Info Edge has witnessed a falling wedge pattern breakout on the daily chart and post-breakout prices have retested their trend line support and completed their throwback.Prices have given a decisive break out of a downward sloping trend line and currently hovering above the upper band of the falling channel pattern on the weekly interval.Stock is trading above its 21, 50 &amp;amp;amp; 100-Day exponential moving averages on the daily time frame, which is positive for the prices in the near term.MACD indicator is reading above its centerline with a positive crossover above its signal line. &nbsp;Momentum oscillator RSI (14) is reading near 60 levels which indicates positive momentum will like to continue ahead.IGL: Buy| CMP: Rs. 557.75| Target: Rs 595|Stop Loss: Rs 537| Upside 6%The prices were trading in a range of 540 to 510 for almost three months and have formed rectangle pattern formation on the daily chart.IGL has broken out of a rectangle pattern at 549.95 levels on 29th June and the prices have registered a decisive breakout that suggests a change in the trend from sideways to upside.The stock is trading above its 21, 50 &amp;amp;amp; 100- day exponential moving averages on the daily time frame, which is positive for the prices in the near term.MACD is also showing a positive crossover and sustaining above the centerline, further indicates an upside direction for the stock.The Parabolic SAR indicator is below the current market prices and acting as short-term support for the stock at the lower band of the pattern.Disclaimer: The views and investment tips expressed by investment experts on Moneycontrol.com are his own and not that of the website or its management. Moneycontrol.com advises users to check with certified experts before taking any investment decisions.", "articleSection": "Business", "headline": "Hot Stocks: ICICI Lombard, Info Edge and IGL top buy ideas, here&rsquo;s why", "description": "If the index breaks the crucial resistance zone of 15920-16000 levels in the coming trading sessions then buying will resume again. Support for the index is placed near 15500 levels which are clubbed with a SAR indicator.", "author": "Rohan Patil", "datePublished": "2021-07-01T07:24:10+05:30", "dateModified": "2021-07-01T07:26:12+05:30", "image": {"@context": "https://schema.org", "@type": "ImageObject", "width": "630px", "height": "354px", "url": "https://images.moneycontrol.com/static-mcnews/2021/06/stocks_sensex_nifty_stockmarkets-770x433.jpg"}, "publisher": {"@context": "https://schema.org", "@type": "Organization", "name": "Moneycontrol", "logo": {"@context": "https://schema.org", "@type": "ImageObject", "width": "247px", "height": "94px", "url": "https://images.moneycontrol.com/images/common/header/logo.png"}, "url": "https://www.moneycontrol.com"}}], "author": {"name": "Rohan Patil", "designation": "Contributor|. "}, "title": "Hot Stocks: ICICI Lombard, Info Edge and IGL top buy ideas, here’s why", "description": "If the index breaks the crucial resistance zone of 15920-16000 levels in the coming trading sessions then buying will resume again. Support for the index is placed near 15500 levels which are clubbed with a SAR indicator.", "published_at": " July 01, 2021  / 07:26 AM IST  ", "tags": [{"name": "#Hot Stocks", "link": "https://www.moneycontrol.com/news/tags/hot-stocks.html"}, {"name": "#Market Edge", "link": "https://www.moneycontrol.com/news/tags/market-edge.html"}, {"name": "#MARKET OUTLOOK", "link": "https://www.moneycontrol.com/news/tags/market-outlook.html"}, {"name": "#Nifty", "link": "https://www.moneycontrol.com/news/tags/nifty.html"}, {"name": "#Podcast", "link": "https://www.moneycontrol.com/news/tags/podcast.html"}, {"name": "#Rohan Patil", "link": "https://www.moneycontrol.com/news/tags/rohan-patil.html"}, {"name": "#Sensex", "link": "https://www.moneycontrol.com/news/tags/sensex.html"}, {"name": "#stock recommendations", "link": "https://www.moneycontrol.com/news/tags/stock-recommendations.html"}, {"name": "#Technical Recommendations", "link": "https://www.moneycontrol.com/news/tags/technical-recommendations.html"}], "related_stories": [{"link": "https://www.moneycontrol.com/news/business/markets/hot-stocks-mm-financial-services-and-piramal-enterprises-can-give-up-to-16-return-in-short-term-7495481.html", "title": "Hot Stocks | M&M Financial Services and Piramal Enterprises can give up to 16% return in short term"}, {"link": "https://www.moneycontrol.com/news/business/markets/hot-stocks-canara-bank-concor-and-hdfc-amc-are-good-short-term-bets-heres-why-7445871.html", "title": "Hot Stocks | Canara Bank, Concor and HDFC AMC are good short-term bets, here's why"}, {"link": "https://www.moneycontrol.com/news/business/markets/hot-stocks-can-bet-on-britannia-mm-financial-services-torrent-power-for-short-term-7417731.html", "title": "Hot Stocks | Can bet on Britannia, M&M Financial Services, Torrent Power for short term"}], "moneycontrol_stock_ids": null, "calls_data": [{"call_type": "buy", "stock_name": "ICICI Lombard General Insurance: Buy", "ltp": "1567", "target": "1648", "stop_loss": ".1520", "upside_potential": " Upside 5%"}]}