{"metadata": [{"@context": "https://schema.org", "mainEntityOfPage": "https://www.moneycontrol.com/news/business/markets/hot-stocks-icici-prudential-jsw-steel-top-buy-ideas-for-3-4-weeks-heres-why-7242981.html", "@type": "NewsArticle", "url": "https://www.moneycontrol.com/news/business/markets/hot-stocks-icici-prudential-jsw-steel-top-buy-ideas-for-3-4-weeks-heres-why-7242981.html", "articleBody": "The Nifty50 registered its lifetime high of 15,962.25 on July 16, 2021 and slipped almost 380 points in the next two trading sessions.The benchmark Index witnessed a smaller degree V-shaped reversal on the daily chart after forming a low of 15,578.55 on July 20 and post that recovered more than two percent in two consecutive trading sessions.Indian bourses on the July 28 started with a major sell-off and breached 15,550 levels in the intraday chart. Later on, in the second half of the trading session, prices witnessed a V-reversal rally in the intraday chart and recovered almost 150 points, and closed marginally above 15,700 levels.On the daily chart, prices have made hammer candlestick formation which indicates buyers were able to overcome the sellers.Prices have again touched its lower band of the channel pattern and witnessed a solid recovery. On a previous couple of occasions, prices have shown the same tendency of reversal from its lower point of the pattern.The lower band of the pattern is also supported with 50-days exponentials moving average which is acting as a strong anchor point for the index.Benchmark Index on the daily chart continues to trade in a narrow range horizontal channel pattern from the past eight weeks.The width of the channel pattern is off almost three-fifty points where a lower band of the pattern holds support near 15600 levels and the upper band of the pattern is near 15950 levels.If Nifty is able to break the upper band of the pattern which is placed near 15,950 levels then prices may witness a major breakout which will help prices to cross above 16,150 levels. Support for the Nifty is placed near 15,600 - 15,550 levels.Here is a list of recommendations for the next 3-4 weeks:ICICI Prudential Life Insurance Company: Buy| LTP: Rs. 652.60| Target: Rs 692|Stop Loss Rs. 630| Upside 6%Prices traded in a narrow range between Rs 607 and Rs 633 on the daily chart and formed a resistance zone around Rs 633&ndash;635.ICICI Pru has witnessed a horizontal trend line breakout on the daily time frame and the prices are trading above their trend line resistance.Prices are also trading above their short &amp;amp;amp; medium-term exponential moving average which is positive for the prices.There has been above-average volume on the day of the breakout which confirms price volume breakout on the daily time frame.Momentum oscillator RSI (14) is reading above 60 levels with positive crossover on the daily scale, which indicates the uptrend may resume soon.Cadila Healthcare: Sell| LTP: Rs. 577| Target: Rs 542| Stop Loss: Rs. 600| Downside 6%The prices were trading in a range of Rs 600-650 for more than two months and have formed rectangle pattern formation on the daily chart.Cadila has broken out of a rectangle pattern at Rs 598.75 levels on July 27 and the prices have given a decisive breakdown that suggests a change in the trend from sideways to the downside.There has been above-average volume on the day of the breakdown which confirms price volume breakdown on the daily time frame. Prices are trading below its 21 &amp;amp;amp; 50 - day exponential moving averages on the daily chart.Momentum oscillator RSI (14) is reading below 40 levels with negative crossover on the daily scale, which indicates a downtrend may continue for the next few trading sessions.JSW Steel: Buy| LTP: Rs. 721| Target: Rs 776|Stop Loss: Rs 690|Upside 7%JSW Steel has witnessed a falling wedge pattern breakout on the daily time frame and the prices are trading above the trend line resistance.When we observe volume activity there has been above-average volume on the day of the breakout which confirms price volume breakout on the daily time frame.Momentum oscillator RSI (14) is reading above 55 levels with positive crossover on the daily scale, which indicates the uptrend may resume soon.During this recent throwback, the stock took support near 23.60 percent Fibonacci retracement which is placed near 672 levels on the weekly time frame.(The author is a Technical Analyst at Bonanza Portfolio Ltd)Disclaimer: The views and investment tips expressed by experts on Moneycontrol.com are their own and not those of the website or its management. Moneycontrol.com advises users to check with certified experts before taking any investment decisions.", "articleSection": "Business", "headline": "Hot Stocks | ICICI Prudential, JSW Steel top buy ideas for 3-4 weeks, here&rsquo;s why", "description": "If Nifty is able to go above 15,950, then prices may witness a major breakout which will help the index to cross above 16,150. Support is placed near 15,600 - 15,550, said Rohan Patil of Bonanza Portfolio", "author": "Rohan Patil", "datePublished": "2021-07-29T08:36:03+05:30", "dateModified": "2021-07-29T08:37:24+05:30", "image": {"@context": "https://schema.org", "@type": "ImageObject", "width": "630px", "height": "354px", "url": "https://images.moneycontrol.com/static-mcnews/2020/11/Buy_2-770x433.jpg"}, "publisher": {"@context": "https://schema.org", "@type": "Organization", "name": "Moneycontrol", "logo": {"@context": "https://schema.org", "@type": "ImageObject", "width": "247px", "height": "94px", "url": "https://images.moneycontrol.com/images/common/header/logo.png"}, "url": "https://www.moneycontrol.com"}}], "author": {"name": "Rohan Patil", "designation": "Contributor|. "}, "title": "Hot Stocks | ICICI Prudential, JSW Steel top buy ideas for 3-4 weeks, here’s why", "description": "If Nifty is able to go above 15,950, then prices may witness a major breakout which will help the index to cross above 16,150. Support is placed near 15,600 - 15,550, said Rohan Patil of Bonanza Portfolio", "published_at": " July 29, 2021  / 08:37 AM IST  ", "tags": [{"name": "#Bonanza Portfolio", "link": "https://www.moneycontrol.com/news/tags/bonanza-portfolio.html"}, {"name": "#Hot Stocks", "link": "https://www.moneycontrol.com/news/tags/hot-stocks.html"}, {"name": "#MARKET OUTLOOK", "link": "https://www.moneycontrol.com/news/tags/market-outlook.html"}, {"name": "#portfolio strategy", "link": "https://www.moneycontrol.com/news/tags/portfolio-strategy.html"}, {"name": "#Rohan Patil", "link": "https://www.moneycontrol.com/news/tags/rohan-patil.html"}, {"name": "#stock recommendations", "link": "https://www.moneycontrol.com/news/tags/stock-recommendations.html"}, {"name": "#Technical Recommendations", "link": "https://www.moneycontrol.com/news/tags/technical-recommendations.html"}], "related_stories": [{"link": "https://www.moneycontrol.com/news/business/markets/hot-stocks-mm-financial-services-and-piramal-enterprises-can-give-up-to-16-return-in-short-term-7495481.html", "title": "Hot Stocks | M&M Financial Services and Piramal Enterprises can give up to 16% return in short term"}, {"link": "https://www.moneycontrol.com/news/business/markets/hot-stocks-canara-bank-concor-and-hdfc-amc-are-good-short-term-bets-heres-why-7445871.html", "title": "Hot Stocks | Canara Bank, Concor and HDFC AMC are good short-term bets, here's why"}, {"link": "https://www.moneycontrol.com/news/business/markets/hot-stocks-can-bet-on-britannia-mm-financial-services-torrent-power-for-short-term-7417731.html", "title": "Hot Stocks | Can bet on Britannia, M&M Financial Services, Torrent Power for short term"}], "moneycontrol_stock_ids": null, "calls_data": [{"call_type": "buy", "stock_name": "ICICI Prudential Life Insurance Company: Buy", "ltp": ".652.60", "target": "692", "stop_loss": ".630", "upside_potential": " Upside 6%"}, {"call_type": "buy", "stock_name": "Cadila Healthcare: Sell", "ltp": ".577", "target": "542", "stop_loss": ".600", "upside_potential": " Downside 6%"}, {"call_type": "buy", "stock_name": "JSW Steel: Buy", "ltp": ".721", "target": "776", "stop_loss": "690", "upside_potential": "Upside 7%"}]}