{"metadata": [{"@context": "https://schema.org", "mainEntityOfPage": "https://www.moneycontrol.com/news/business/markets/hot-stocks-rpg-life-sciences-arvind-fashions-and-jubilant-ingrevia-can-give-up-to-18-return-in-short-term-7298631.html", "@type": "NewsArticle", "url": "https://www.moneycontrol.com/news/business/markets/hot-stocks-rpg-life-sciences-arvind-fashions-and-jubilant-ingrevia-can-give-up-to-18-return-in-short-term-7298631.html", "articleBody": "Nifty has been consolidating in a range of 16,150-16,350 for the last three consecutive sessions.On August 3,&nbsp;the index registered a breakout from a long consolidation wherein Nifty traded in a range of 15,500-15,963 for almost two months.Sometimes, previous resistance levels interchange their role as a support when the index moves up and the same is the case with the Nifty at present.Earlier resistance of 16,000 would now act as a support for the Nifty. The near-term target should be in the range of 16,450-16,500.This target is derived from adding the gap between the previous consolidation and the breakout levels.In the recent breakout of the market, Bank Nifty and financial service indices took the lead and broke out decisively on their medium-term charts.We expect these indices to outperform further from here. IT and metal indices are in continuation of an uptrend.Smallcap and midcap indices have lost the steam and have turned weak on the short-term charts. Daily RSI exited the overbought zone with a big negative divergence which signals weakness in these indices.So, for the short term, we can expect largecaps to outperform the mid and and smallcaps.The advance-decline ratio has been disappointing for the last four consecutive sessions. However, that does not mean the bull run has ended for the small stocks.Many stocks are reacting to their quarterly results and it is going to be so till August 15. Once the result season is over, we may again see the stock-specific bullish trend in selective stocks in the mid and smallcap segments.The last three session&rsquo;s move in Nifty and Bank Nifty seems more like a temporary halt after a sharp rise. This can be seen as an opportunity to initiate fresh long positions.To conclude, we believe that the choppy trend has ended in the largecap space. We can expect Nifty to hit an upside target range of 16,450-16,500 in the short span of time.Post achieving this target, traders can hold longs with trailing stop-loss and ride the trend further. Nifty has got strong support in the range of 16,000-16,100.Dips should be utilised to create fresh longs in the largecap stocks. However, the real opportunity is seen in financial stocks, private &amp;amp;amp; PSU banks and NBFCs.Traders should stay cautious in mid and smallcap segments as the short-term trend has turned weak.Here are three buy calls for the next 3-4 weeks:RPG Life Sciences | LTP: Rs 518 | Target price: Rs 595 | Stop loss: Rs 480 | Upside: 15%On July 27, this stock broke out from the bullish symmetrical triangle and took out the previous swing high resistance of Rs 477 with a significant jump in volumes.On August 9, it broke out from a bullish flag pattern on the daily chart. It is placed above all important moving averages which indicate an uptrend on all timeframe charts.It is on the verge of surpassing the year 2018 high of Rs 585. Indicators and oscillators, on weekly and monthly charts, have turned bullish.Arvind Fashions | LTP: Rs 212 | Target price: Rs 243 | Stop loss: Rs 194 | Upside: 15%A pennant pattern breakout can be seen on the daily chart. It has been finding support at its 10-day exponential moving average.Price breakout is seen along with the rising volumes. In July, this stock broke out from a multi-month consolidation pattern with a jump in volumes.Indicator and oscillator setup has been bullish on weekly charts. Short-term moving averages are placed above medium to long-term moving averages.Jubilant Ingrevia | LTP: Rs 633.80 | Target price: Rs 749 | Stop loss: Rs 580 | Upside: 18%On July 22, this stock broke out from the previous top resistance of Rs 612. It has ended the previous seven weeks' narrow consolidation.Volumes during the breakout were significantly higher which has confirmed the bullish breakout.Short-term moving averages are placed above medium to long-term moving averages.Indicators and oscillators have been showing strength in the current uptrend.(The author is a technical research analyst at HDFC securities)Disclaimer: The views and investment tips expressed by investment experts on Moneycontrol.com are their own and not that of the website or its management. Moneycontrol.com advises users to check with certified experts before taking any investment decisions.", "articleSection": "Business", "headline": " Hot Stocks | RPG Life Sciences, Arvind Fashions and Jubilant Ingrevia can give up to 18% return in short...", "description": "Dips should be utilised to create fresh longs in the largecap stocks. However, the real opportunity is seen in financial stocks, private &amp;amp; PSU banks and NBFCs, said Vinay Rajani of HDFC securities.", "author": "Vinay Rajani", "datePublished": "2021-08-10T07:21:08+05:30", "dateModified": "2021-08-10T07:21:08+05:30", "image": {"@context": "https://schema.org", "@type": "ImageObject", "width": "630px", "height": "354px", "url": "https://images.moneycontrol.com/static-mcnews/2021/08/shutterstock_1153099931-770x433.jpg"}, "publisher": {"@context": "https://schema.org", "@type": "Organization", "name": "Moneycontrol", "logo": {"@context": "https://schema.org", "@type": "ImageObject", "width": "247px", "height": "94px", "url": "https://images.moneycontrol.com/images/common/header/logo.png"}, "url": "https://www.moneycontrol.com"}}], "author": {"name": ["Vinay Rajani"], "designation": ["Technical Research Analyst|HDFC Securities "]}, "title": "Hot Stocks | RPG Life Sciences, Arvind Fashions and Jubilant Ingrevia can give up to 18% return in short term", "description": "Dips should be utilised to create fresh longs in the largecap stocks. However, the real opportunity is seen in financial stocks, private & PSU banks and NBFCs, said Vinay Rajani of HDFC securities.", "published_at": " August 10, 2021  / 07:21 AM IST  ", "tags": [{"name": "#Hot Stocks", "link": "https://www.moneycontrol.com/news/tags/hot-stocks.html"}, {"name": "#markets", "link": "https://www.moneycontrol.com/news/tags/markets.html"}, {"name": "#Nifty", "link": "https://www.moneycontrol.com/news/tags/nifty.html"}, {"name": "#Podcast", "link": "https://www.moneycontrol.com/news/tags/podcast.html"}, {"name": "#Stocks Views", "link": "https://www.moneycontrol.com/news/tags/stocks-views.html"}], "related_stories": [{"link": "https://www.moneycontrol.com/news/business/markets/hot-stocks-gujarat-narmada-valley-gsfc-and-tinplate-company-can-give-double-digit-returns-in-short-term-7542981.html", "title": "Hot Stocks | Gujarat Narmada Valley, GSFC and Tinplate Company can give double-digit returns in short term"}, {"link": "https://www.moneycontrol.com/news/business/markets/hot-stocks-you-can-buy-rpg-life-science-beml-but-sell-granules-india-heres-why-7487291.html", "title": "Hot Stocks | Buy RPG Life Science, BEML, but sell Granules India. Here's why"}, {"link": "https://www.moneycontrol.com/news/business/markets/hot-stocks-century-textile-vip-industries-can-fin-homes-can-give-up-to-13-return-in-short-term-7436681.html", "title": "Hot Stocks | Century Textile, VIP Industries, Can Fin Homes can give up to 13% return in short term"}], "moneycontrol_stock_ids": null, "calls_data": [{"call_type": "buy", "stock_name": "RPG Life Sciences ", "ltp": "518", "target": "595", "stop_loss": "480", "upside_potential": " Upside: 15%"}, {"call_type": "buy", "stock_name": "Arvind Fashions ", "ltp": "212", "target": "243", "stop_loss": "194", "upside_potential": " Upside: 15%"}, {"call_type": "buy", "stock_name": "Jubilant Ingrevia ", "ltp": "633.80", "target": "749", "stop_loss": "580", "upside_potential": " Upside: 18%"}]}