{"metadata": [{"@context": "https://schema.org", "mainEntityOfPage": "https://www.moneycontrol.com/news/business/markets/hot-stocks-century-textile-vip-industries-can-fin-homes-can-give-up-to-13-return-in-short-term-7436681.html", "@type": "NewsArticle", "url": "https://www.moneycontrol.com/news/business/markets/hot-stocks-century-textile-vip-industries-can-fin-homes-can-give-up-to-13-return-in-short-term-7436681.html", "articleBody": "Nifty rose for the third consecutive session to close at new all time high of 17,377.80 on September 6.By surpassing 17,350, Nifty has retraced more than 200 percent of the entire fall which was seen from January 2020 (12,430) to March 2020 (7,511).Momentum oscillator RSI has reached above 70 level on daily, weekly and monthly timeframes, which shows the overbought conditions in the current scenario.However, being in the overbought zone does not mean correction would come immediately.Nifty can keep adding gains while RSI may remain in the overbought zone for an extended period.An important thing to note is that on all timeframes, RSI has not developed negative divergence which shows that the current rally carries a lot of strength.Even if Nifty corrects for some reason, it should be considered an buying opportunity.If any major top is to be formed then the last upswing would come up with lower top in RSI on daily timeframe, which would result in negative divergence and such scenario is not seen as of yet.The ADX indicator has been rising and has reached above 38 on daily timeframe, which indicates the rising momentum in the uptrend.The daily ADX is still at a fair distance from the +DI line, which leaves more upside room for Nifty to extend the gains.Among the sectors, realty, IT and metals look attractive on short to medium-term charts.Nifty Smallcap index has recouped almost all the losses and reached near its lifetime highs which augers well for the overall health of the market.The level of 17,000 has become short-term support for the Nifty and with that stop loss, traders should remain long.Far support for the Nifty is seen at 16,700. As far as resistance is concerned, traders should not anticipate any target and should keep long positions with trailing stop loss basis.Here are three buy calls for the next 3-4 weeks:Century Textile | LTP: Rs 865 | Target price: Rs 970 | Stop loss: Rs 815 | Upside: 12%This stock has broken out from double top resistance of Rs 832 with rising volumes.Indicator and oscillator setup has been bullish on weekly charts. The short term moving averages are placed above medium to long term moving averages.It has been forming higher tops and higher bottoms on weekly and monthly charts.Moreover, the realty sector has been performing very well and this company has a good exposure in realty sector.VIP Industries | LTP: Rs 478.05 | Target price: Rs 538 | Stop loss: Rs 425 | Upside: 13%A downward sloping trendline breakout is seen on the weekly charts. In August, this stock saw a huge amount of volume building along with rising price.A bullish cup and handle pattern breakout is visible on the weekly charts.Though RSI has reached overbought zone, it has not shown any sign of negative divergence.Weekly MACD has been above signal and equilibrium line. The stock is placed above medium to long term moving averages, indicating bullish trend on all timeframes.Can Fin Homes | LTP: Rs 598.15 | Target price: Rs 675 | Stop loss: Rs 550 | Upside: 13%This stock has broken out from the last five sessions' price consolidation. It has also broken out from the bullish flag pattern on weekly charts.Price breakout is seen along with the jump in volumes.Indicator and oscillator setup has been bullish on weekly charts. The short term moving averages are placed above medium to long term moving averages.(The author is a technical research analyst at HDFC securities)Disclaimer: The views and investment tips expressed by investment experts on Moneycontrol.com are their own and not that of the website or its management. Moneycontrol.com advises users to check with certified experts before taking any investment decisions.", "articleSection": "Business", "headline": "Hot Stocks | Century Textile, VIP Industries, Can Fin Homes can give up to 13% return in short term", "description": "&amp;quot;Far support for the Nifty is seen at 16,700. As far as resistance is concerned, traders should not anticipate any target and should keep long positions with trailing stop loss basis,&amp;quot; said Vinay Rajani of HDFC securities.", "author": "Vinay Rajani", "datePublished": "2021-09-07T07:56:46+05:30", "dateModified": "2021-09-07T07:56:46+05:30", "image": {"@context": "https://schema.org", "@type": "ImageObject", "width": "630px", "height": "354px", "url": "https://images.moneycontrol.com/static-mcnews/2021/08/shutterstock_1153099931-770x433.jpg"}, "publisher": {"@context": "https://schema.org", "@type": "Organization", "name": "Moneycontrol", "logo": {"@context": "https://schema.org", "@type": "ImageObject", "width": "247px", "height": "94px", "url": "https://images.moneycontrol.com/images/common/header/logo.png"}, "url": "https://www.moneycontrol.com"}}], "author": {"name": ["Vinay Rajani"], "designation": ["Technical Research Analyst|HDFC Securities "]}, "title": "Hot Stocks | Century Textile, VIP Industries, Can Fin Homes can give up to 13% return in short term", "description": "\"Far support for the Nifty is seen at 16,700. As far as resistance is concerned, traders should not anticipate any target and should keep long positions with trailing stop loss basis,\" said Vinay Rajani of HDFC securities.", "published_at": " September 07, 2021  / 07:56 AM IST  ", "tags": [{"name": "#Hot Stocks", "link": "https://www.moneycontrol.com/news/tags/hot-stocks.html"}, {"name": "#markets", "link": "https://www.moneycontrol.com/news/tags/markets.html"}, {"name": "#Nifty", "link": "https://www.moneycontrol.com/news/tags/nifty.html"}, {"name": "#Podcast", "link": "https://www.moneycontrol.com/news/tags/podcast.html"}, {"name": "#Stocks Views", "link": "https://www.moneycontrol.com/news/tags/stocks-views.html"}], "related_stories": [{"link": "https://www.moneycontrol.com/news/business/markets/hot-stocks-gujarat-narmada-valley-gsfc-and-tinplate-company-can-give-double-digit-returns-in-short-term-7542981.html", "title": "Hot Stocks | Gujarat Narmada Valley, GSFC and Tinplate Company can give double-digit returns in short term"}, {"link": "https://www.moneycontrol.com/news/business/markets/hot-stocks-you-can-buy-rpg-life-science-beml-but-sell-granules-india-heres-why-7487291.html", "title": "Hot Stocks | Buy RPG Life Science, BEML, but sell Granules India. Here's why"}, {"link": "https://www.moneycontrol.com/news/business/markets/hot-stocks-schaeffler-india-lt-technology-services-britannia-industries-can-give-up-to-17-return-in-short-term-7375541.html", "title": "Hot Stocks | Schaeffler India, L&T Technology and Britannia can give double-digit returns in short term"}], "moneycontrol_stock_ids": null, "calls_data": [{"call_type": "buy", "stock_name": "Century Textile ", "ltp": "865", "target": "970", "stop_loss": "815", "upside_potential": " Upside: 12%"}, {"call_type": "buy", "stock_name": "VIP Industries ", "ltp": "478.05", "target": "538", "stop_loss": "425", "upside_potential": " Upside: 13%"}, {"call_type": "buy", "stock_name": "Can Fin Homes ", "ltp": "598.15", "target": "675", "stop_loss": "550", "upside_potential": " Upside: 13%"}]}