{"metadata": [{"@context": "https://schema.org", "mainEntityOfPage": "https://www.moneycontrol.com/news/business/markets/hot-stocks-heres-why-you-should-buy-hpcl-but-sell-tata-steel-and-titan-7483011.html", "@type": "NewsArticle", "url": "https://www.moneycontrol.com/news/business/markets/hot-stocks-heres-why-you-should-buy-hpcl-but-sell-tata-steel-and-titan-7483011.html", "articleBody": "Nifty ended the past week a tad below the 17,600-mark by adding more than a percent to its previous weekly close.For the last few days, Nifty was trapped in a small range and finally, it managed to find some momentum.The trend is extremely strong, but the current move is not giving us comfort. We reiterate that when things start to look hunky-dory and there are no signs of correction, the market surprises.Yes, it&rsquo;s difficult to predict the precise time, but it&rsquo;s always better to be safe than sorry. As of now, we are not advising to short but at least one can choose to keep booking profits on regular intervals and stay light on positions.The sharp correction of September 17 from higher levels is clearly an indication of this and hence we continue with our cautious stance.As far as levels are concerned, 17,700&ndash;17,800 are to be seen as immediate hurdles whereas, 17,450&ndash;17,250 should be treated as key supports.The first sign of real weakness would come only if we start sliding below the lower range.The banking space had the lion's share in the last week's rally as we saw Bank Nifty coming out of its long slumber to post a fresh record high of 38,112.75.Going ahead, all eyes would be on this heavyweight basket because if Nifty has to move towards 18,000, this space needs to continue its momentum.In addition, the broader end of the spectrum had a fabulous run throughout last week but we saw some decent profit-booking in this space as well on the last day, which does not bode well.Hence, we remain a bit sceptical and we expect the picture to get clear in the coming week.Here is one buy and two sell calls for the next 2-3 weeks:HPCL | Buy | LTP: Rs 282.95 | Target price: Rs 298 | Stop loss: Rs 274 | Upside: 5%The stocks of some oil marketing companies have done well recently, especially BPCL and Indian Oil Corporation that are trading at their 52-week highs.But HPCL has been a laggard and could not move in tandem with its peers. Now, the way it is shaped up, we may see some catch-up in the coming days.On the daily timeframe chart, the inverse head and shoulder pattern is clearly visible and the breakout of the same has been confirmed during the latter part of the week gone by.Looking at the rising values of the momentum oscillator, we recommend buying for a short-term target of Rs 298 with a stop loss of Rs 274.Tata Steel | Sell | LTP: Rs 1,385.90 | Target price: Rs 1,330 | Stop loss: Rs 1,442 | Downside: 4%Globally, we are seeing a super-cycle in the entire commodity basket. Along with other commodity stocks, the metal counters have been benefiting from this optimism.But some of the steel counters have started consolidating in the last couple of weeks and this counter has been witnessing selling for the last two consecutive sessions.This stock has confirmed a trendline breakdown from its key support of Rs 1,390 on a closing basis.Traders can look to short this counter on a small bounce for a short-term target of Rs 1,330. The stop loss can be placed at Rs 1,442.Titan Company | Sell | LTP: Rs 2,095.60 | Target price: Rs 2,000 | Stop loss: Rs 2,152 | Downside: 5%This stock has been one of the rank outperformers of late. In fact, it has proved its worth over and over again in the last couple of decades.Undoubtedly, the higher degree trend remains bullish but with a near-term view, we are seeing some early signs of fatigue.On September 17, the stock suddenly nosedived from its record high and closed almost at the lowest point of the day.This may not change the complete trend but at least we may see some decent profit-booking in the coming days. Hence, traders are advised to short with strict stop loss above Rs 2,152 for a target of Rs 2,000.(The author is Chief Technical &amp;amp;amp; Derivatives Analyst at Angel Broking)Disclaimer: The views and investment tips expressed by investment experts on Moneycontrol.com are their own and not that of the website or its management. Moneycontrol.com advises users to check with certified experts before taking any investment decisions.", "articleSection": "Business", "headline": "Hot Stocks: Here's why you should buy HPCL, but sell Tata Steel and Titan", "description": "&amp;quot;As far as levels are concerned, 17,700&ndash;17,800 are to be seen as immediate hurdles whereas, on the flip side, 17,450&ndash;17,250 should be treated as key supports,&amp;quot; said Sameet Chavan of Angel Broking. ", "author": "Sameet Chavan", "datePublished": "2021-09-20T07:25:47+05:30", "dateModified": "2021-09-20T07:25:47+05:30", "image": {"@context": "https://schema.org", "@type": "ImageObject", "width": "630px", "height": "354px", "url": "https://images.moneycontrol.com/static-mcnews/2021/09/Hot-Stock.Pixabay-1-770x433.jpg"}, "publisher": {"@context": "https://schema.org", "@type": "Organization", "name": "Moneycontrol", "logo": {"@context": "https://schema.org", "@type": "ImageObject", "width": "247px", "height": "94px", "url": "https://images.moneycontrol.com/images/common/header/logo.png"}, "url": "https://www.moneycontrol.com"}}], "author": {"name": ["Sameet Chavan"], "designation": ["Chief Analyst- Technicals & Derivatives|Angel Broking "]}, "title": "Hot Stocks: Here's why you should buy HPCL, but sell Tata Steel and Titan", "description": "\"As far as levels are concerned, 17,700–17,800 are to be seen as immediate hurdles whereas, on the flip side, 17,450–17,250 should be treated as key supports,\" said Sameet Chavan of Angel Broking. ", "published_at": " September 20, 2021  / 07:25 AM IST  ", "tags": [{"name": "#Hot Stocks", "link": "https://www.moneycontrol.com/news/tags/hot-stocks.html"}, {"name": "#Hot Stocks Podcast", "link": "https://www.moneycontrol.com/news/tags/hot-stocks-podcast.html"}, {"name": "#markets", "link": "https://www.moneycontrol.com/news/tags/markets.html"}, {"name": "#Nifty", "link": "https://www.moneycontrol.com/news/tags/nifty.html"}, {"name": "#Podcast", "link": "https://www.moneycontrol.com/news/tags/podcast.html"}, {"name": "#stocks", "link": "https://www.moneycontrol.com/news/tags/stocks.html"}], "related_stories": [{"link": "https://www.moneycontrol.com/news/business/markets/hot-stocks-here-is-why-you-should-buy-cigniti-tech-and-sell-sbi-life-insurance-7566351.html", "title": "Hot Stocks | Here is why you should buy Cigniti Tech and sell SBI Life Insurance"}, {"link": "https://www.moneycontrol.com/news/business/markets/hot-stocks-here-is-why-you-should-buy-kirloskar-ferrous-and-sell-tcs-7535271.html", "title": "Hot Stocks | Here is why you should buy Kirloskar Ferrous and sell TCS"}, {"link": "https://www.moneycontrol.com/news/business/markets/hot-stocks-heres-why-you-should-buy-blue-star-ongc-but-sell-jubilant-foodworks-7508941.html", "title": "Hot Stocks | Here's why you should buy Blue Star, ONGC but sell Jubilant FoodWorks"}], "moneycontrol_stock_ids": null, "calls_data": [{"call_type": "buy", "stock_name": "HPCL ", "ltp": "282.95", "target": "298", "stop_loss": "274", "upside_potential": " Upside: 5%"}, {"call_type": "sell", "stock_name": "Tata Steel ", "ltp": "1385.90", "target": "1330", "stop_loss": "1442", "upside_potential": " Downside: 4%"}, {"call_type": "sell", "stock_name": "Titan Company ", "ltp": "2095.60", "target": "2000", "stop_loss": "2152", "upside_potential": " Downside: 5%"}]}