{"metadata": [{"@context": "https://schema.org", "mainEntityOfPage": "https://www.moneycontrol.com/news/business/markets/hot-stocks-you-can-buy-rpg-life-science-beml-but-sell-granules-india-heres-why-7487291.html", "@type": "NewsArticle", "url": "https://www.moneycontrol.com/news/business/markets/hot-stocks-you-can-buy-rpg-life-science-beml-but-sell-granules-india-heres-why-7487291.html", "articleBody": "Nifty has fallen more than 2 percent from its recent top of 17,792.95. The index has violated the short-term support of its five-day exponential moving average (EMA) but is still maintaining its level above 10 and 20-day EMA supports.Higher tops and higher bottoms are also well intact on the short-term charts. RSI on the daily chart has exited the overbought zone and crossed the signal line on the downside, but there is no sign of negative divergence as yet for Nifty and Bank Nifty.Previous swing low support is placed at 17,254 which can act as immediate support for the Nifty.RSI getting into the overbought zone is not a sign of trend reversal. We should rather see it as to whether the recent upswing has relative strength in it or not.If Nifty makes a new high and RSI fails to make a new high then we can consider it as a bearish trend reversal signal.Looking at the Nifty and Bank Nifty chart, it is clearly visible that both price and oscillator have been forming higher tops and there is no divergence between them.So, we can see the ongoing fall in the market as a correction rather than a reversal. Corrections are part of the bull market and in bull market corrections usually remain sharp and swift.In the current market condition, we expect the IT and FMCG sectors to outperform while sectors like pharma and metal may still remain under pressure.Most of the derivative stock closed on a weak wicket and they are expected to extend the correction in the coming sessions.The index could limit its fall to 1-2 percent, but stocks could have a bigger negative impact in the short term.The Indian equity market is among the top-performing markets in the world if we normalise the performance since March 2020 bottom.However, continuous weakness in global markets could hurt market sentiment.On September 20, India VIX surged almost 15 percent to close at 17.5 odd levels. This Index is also known as the fear index.India VIX has reached the highest level since May 27, 2021, which indicates the rising volatility in Nifty option premiums and bearish sentiments.We expect the ongoing correction to extend towards 17,250 and 17,000 levels. However, as the primary trend of the market is still bullish, positional traders can wait for these support levels to enter fresh long positions.Here are two buy and one sell calls for the next 2-3 weeks:RPG Life Science | Buy | LTP: Rs 684.30 | Target price: Rs 799 | Stop loss: Rs 620 | Upside: 17%This month, this stock has surpassed the previous all-time high of Rs 579 and has been sustaining above that level.It has entered into a bullish momentum zone where the gap between short and medium-term moving averages has started to widen.It has been finding support at every decline and has been showing resilient moves in the weak market conditions.On September 20, it hit a new all-time high. There is a big jump in volumes along with the price rise in the last three months.BEML | Buy | LTP: Rs 1,396.90 | Target price: Rs 1,575 | Stop loss: Rs 1,260 | Upside: 13%This stock has been correcting along with the market for the last three sessions.The primary trend of the stock is bullish as it broke out from the symmetrical triangle in the week ended September 17, 2021.It is placed above its 20, 50 and 100-day moving averages. Indicator and oscillator setup has been holding bullish on weekly charts.Short-term moving averages are placed above medium to long-term moving averages. The stock has been forming higher tops and higher bottoms on weekly and monthly charts.Granules India | Sell | LTP: Rs 320.35 | Target price: Rs 298 | Stop loss: Rs 337 | Downside: 7%This stock has been trading below its 20, 50, 100 and 200-day moving averages. It has been forming lower tops and lower bottoms on the daily chart.The indicator and oscillator setup has been showing a bearish trend on weekly charts. Short-term moving averages are placed below medium-term moving averages.(The author is a technical research analyst at HDFC securities)Disclaimer: The views and investment tips expressed by investment experts on Moneycontrol.com are their own and not that of the website or its management. Moneycontrol.com advises users to check with certified experts before taking any investment decisions.", "articleSection": "Business", "headline": "Hot Stocks | Buy RPG Life Science, BEML, but sell Granules India. Here's why", "description": "Previous swing low support is placed at 17,254 which can act as immediate support for the Nifty.", "author": "Vinay Rajani", "datePublished": "2021-09-21T07:39:51+05:30", "dateModified": "2021-09-21T07:43:32+05:30", "image": {"@context": "https://schema.org", "@type": "ImageObject", "width": "630px", "height": "354px", "url": "https://images.moneycontrol.com/static-mcnews/2021/09/shutterstock_1050045188-770x433.jpg"}, "publisher": {"@context": "https://schema.org", "@type": "Organization", "name": "Moneycontrol", "logo": {"@context": "https://schema.org", "@type": "ImageObject", "width": "247px", "height": "94px", "url": "https://images.moneycontrol.com/images/common/header/logo.png"}, "url": "https://www.moneycontrol.com"}}], "author": {"name": ["Vinay Rajani"], "designation": ["Technical Research Analyst|HDFC Securities "]}, "title": "Hot Stocks | Buy RPG Life Science, BEML, but sell Granules India. Here's why", "description": "Previous swing low support is placed at 17,254 which can act as immediate support for the Nifty.", "published_at": " September 21, 2021  / 07:43 AM IST  ", "tags": [{"name": "#Hot Stocks", "link": "https://www.moneycontrol.com/news/tags/hot-stocks.html"}, {"name": "#markets", "link": "https://www.moneycontrol.com/news/tags/markets.html"}, {"name": "#Nifty", "link": "https://www.moneycontrol.com/news/tags/nifty.html"}, {"name": "#Podcast", "link": "https://www.moneycontrol.com/news/tags/podcast.html"}, {"name": "#Stocks Views", "link": "https://www.moneycontrol.com/news/tags/stocks-views.html"}], "related_stories": [{"link": "https://www.moneycontrol.com/news/business/markets/hot-stocks-gujarat-narmada-valley-gsfc-and-tinplate-company-can-give-double-digit-returns-in-short-term-7542981.html", "title": "Hot Stocks | Gujarat Narmada Valley, GSFC and Tinplate Company can give double-digit returns in short term"}, {"link": "https://www.moneycontrol.com/news/business/markets/hot-stocks-century-textile-vip-industries-can-fin-homes-can-give-up-to-13-return-in-short-term-7436681.html", "title": "Hot Stocks | Century Textile, VIP Industries, Can Fin Homes can give up to 13% return in short term"}, {"link": "https://www.moneycontrol.com/news/business/markets/hot-stocks-schaeffler-india-lt-technology-services-britannia-industries-can-give-up-to-17-return-in-short-term-7375541.html", "title": "Hot Stocks | Schaeffler India, L&T Technology and Britannia can give double-digit returns in short term"}], "moneycontrol_stock_ids": null, "calls_data": [{}, {}, {}, {}, {}, {}, {}, {}, {}, {}, {"call_type": "buy", "stock_name": "RPG Life Science ", "ltp": "684.30", "target": "799", "stop_loss": "620", "upside_potential": " Upside: 17%"}, {"call_type": "buy", "stock_name": "BEML ", "ltp": "1396.90", "target": "1575", "stop_loss": "1260", "upside_potential": " Upside: 13%"}, {"call_type": "sell", "stock_name": "Granules India ", "ltp": "320.35", "target": "298", "stop_loss": "337", "upside_potential": " Downside: 7%"}, {}, {}, {}, {}, {}, {}, {}, {}, {}, {}, {}, {}, {}, {}, {}, {}, {}, {}, {}, {}, {}, {}, {}, {}, {}, {}, {}, {}]}